Repository: TanvishGG/Krishi-Sakhi
Catalog: Flutter App/lib/l10n/app_*.arb
Languages: bn, kn, ml, pa, ta, te

# appTitle
source: Krishi Sakhi
bn: কৃষি সখী
kn: ಕೃಷಿ ಸಖಿ
ml: കൃഷി സഖി
pa: ਕ੍ਰਿਸ਼ੀ ਸਖੀ
ta: கிருஷி சகி
te: కృషి సఖి

source: Welcome
bn: স্বাগতম
kn: ಸ್ವಾಗತ
ml: സ്വാഗതം
pa: ਜੀ ਆਇਆਂ ਨੂੰ
ta: வரவேற்கிறோம்
te: స్వాగతం

source: Login
bn: লগইন
kn: ಲಾಗಿನ್
ml: ലോഗിൻ
pa: ਲਾਗਇਨ
ta: உள்நுழைவு
te: లాగిన్

source: Logout
bn: লগ আউট
kn: ಲಾಗ್ ಔಟ್
ml: ലോഗൗട്ട്
pa: ਲੌਗ ਆਉਟ
ta: வெளியேறு
te: లాగ్ అవుట్

source: Email
bn: ইমেইল
kn: ಇಮೇಲ್
ml: ഇമെയിൽ
pa: ਈਮੇਲ
ta: மின்னஞ்சல்
te: ఇమెయిల్

source: Phone
bn: ফোন
kn: ಫೋನ್
ml: ഫോൺ
pa: ਫੋਨ
ta: தொலைபேசி
te: ఫోన్

source: Password
bn: পাসওয়ার্ড
kn: ಪಾಸ್‌ವರ್ಡ್
ml: പാസ്‌വേഡ്
pa: ਪਾਸਵਰਡ
ta: கடவுச்சொல்
te: పాస్‌వర్డ్

source: Sign In
bn: সাইন ইন
kn: ಸೈನ್ ಇನ್
ml: സൈൻ ഇൻ
pa: ਸਾਇਨ ਇਨ
ta: உள்நுழைக
te: సైన్ ఇన్

source: Sign Up
bn: সাইন আপ
kn: ಸೈನ್ ಅಪ್
ml: സൈൻ അപ്പ്
pa: ਸਾਇਨ ਅੱਪ
ta: பதிவு செய்க
te: సైన్ అప్

source: Forgot Password?
bn: পাসওয়ার্ড ভুলে গেছেন?
kn: ಪಾಸ್‌ವರ್ಡ್ ಮರೆತಿದ್ದೀರಾ?
ml: പാസ്‌വേഡ് മറന്നോ?
pa: ਪਾਸਵਰਡ ਭੁੱਲ ਗਏ?
ta: கடவுச்சொல் மறந்துவிட்டதா?
te: పాస్‌వర్డ్ మర్చిపోయారా?

source: Create Account
bn: অ্যাকাউন্ট তৈরি করুন
kn: ಖಾತೆ ರಚಿಸಿ
ml: അക്കൗണ്ട് സൃഷ്ടിക്കുക
pa: ਖਾਤਾ ਬਣਾਓ
ta: கணக்கை உருவாக்கவும்
te: ఖాతా సృష్టించండి

source: Home
bn: হোম
kn: ಮನೆ
ml: ഹോം
pa: ਘਰ
ta: முகப்பு
te: హోమ్

source: Chat
bn: চ্যাট
kn: ಚಾಟ್
ml: ചാറ്റ്
pa: ਚੈਟ
ta: அரட்டை
te: చాట్

source: Voice
bn: ভয়েস
kn: ವಾಯ್ಸ್
ml: വോയ്സ്
pa: ਵੌਇਸ
ta: குரல்
te: వాయిస్

source: Settings
bn: সেটিংস
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು
ml: ക്രമീകരണങ്ങൾ
pa: ਸੈਟਿੰਗਾਂ
ta: அமைப்புகள்
te: సెట్టింగ్స్

source: Profile
bn: প্রোফাইল
kn: ಪ್ರೊಫೈಲ್
ml: പ്രൊഫൈൽ
pa: ਪ੍ਰੋਫਾਈਲ
ta: சுயவிவரம்
te: ప్రొఫైల్

source: Language
bn: ভাষা
kn: ಭಾಷೆ
ml: ഭാഷ
pa: ਭਾਸ਼ਾ
ta: மொழி
te: భాష

# hindi
source: हिंदी
bn: हिन्दी
kn: हिन्दी
ml: हिन्दी
pa: हिन्दी
ta: हिन्दी
te: हिन्दी

source: Grant Permission
bn: অনুমতি দিন
kn: ಅನುಮತಿ ನೀಡಿ
ml: അനുമതി നൽകുക
pa: ਇਜਾਜ਼ਤ ਦਿਓ
ta: அனுமதி வழங்கு
te: అనుమతి ఇవ్వండి

source: Humidity
bn: আর্দ্রতা
kn: ತೇವಾಂಶ
ml: ആർദ്രത
pa: ਨਮੀ
ta: ஈரப்பதம்
te: తేమ

source: Wind
bn: বাতাস
kn: ಗಾಳಿ
ml: കാറ്റ്
pa: ਹਵਾ
ta: காற்று
te: గాలి

source: Rain Today
bn: আজ বৃষ্টি
kn: ಇಂದು ಮಳೆ
ml: ഇന്ന് മഴ
pa: ਅੱਜ ਮੀਂਹ
ta: இன்று மழை
te: ఈరోజు వర్షం

source: Yes
bn: হ্যাঁ
kn: ಹೌದು
ml: അതെ
pa: ਹਾਂ
ta: ஆம்
te: అవును

source: No
bn: না
kn: ಇಲ್ಲ
ml: ഇല്ല
pa: ਨਹੀਂ
ta: இல்லை
te: లేదు

# sevenDayRainForecast
source: 7-Day Rain Forecast
bn: ৭-দিনের বৃষ্টির পূর্বাভাস
kn: 7-ದಿನಗಳ ಮಳೆ ಮುನ್ಸೂಚನೆ
ml: 7-ദിവസത്തെ മഴ പ്രവചനം
pa: 7-ਦਿਨਾਂ ਦਾ ਮੀਂਹ ਪੂਰਵ-ਅਨੁਮਾਨ
ta: 7-நாள் மழை முன்னறிவிப்பு
te: 7-రోజుల వర్షం అంచనా

# monday
source: Mon
bn: সোম
kn: ಸೋಮ
ml: തിങ്കൾ
pa: ਸੋਮ
ta: திங்
te: సోమ

# tuesday
source: Tue
bn: মঙ্গল
kn: ಮಂಗಳ
ml: ചൊവ്വ
pa: ਮੰਗਲ
ta: செவ்
te: మంగళ

# wednesday
source: Wed
bn: বুধ
kn: ಬುಧ
ml: ബുധൻ
pa: ਬੁੱਧ
ta: புத
te: బుధ

# thursday
source: Thu
bn: বৃহস্পতি
kn: ಗುರು
ml: വ്യാഴം
pa: ਵੀਰ
ta: வியா
te: గురు

# friday
source: Fri
bn: শুক্র
kn: ಶುಕ್ರ
ml: വെള്ളി
pa: ਸ਼ੁੱਕਰ
ta: வெள்
te: శుక్ర

# saturday
source: Sat
bn: শনি
kn: ಶನಿ
ml: ശനി
pa: ਸ਼ਨਿੱਚਰ
ta: சனி
te: శని

# sunday
source: Sun
bn: রবি
kn: ಭಾನು
ml: ഞായർ
pa: ਐਤਵਾਰ
ta: ஞாயி
te: ఆది

source: Listening
bn: শুনছি
kn: ಕೇಳುತ್ತಿದ್ದೇನೆ
ml: കേൾക്കുന്നു
pa: ਸੁਨ ਰਿਹਾ ਹੈ
ta: கேட்கிறது
te: వింటున్నాం

source: Ready to talk
bn: কথা বলার জন্য প্রস্তুত
kn: ಮಾತನಾಡಲು ಸಿದ್ಧ
ml: സംസാരിക്കാൻ തയ്യാർ
pa: ਗੱਲ ਕਰਨ ਲਈ ਤਿਆਰ
ta: பேச தயாராக உள்ளது
te: మాట్లాడటానికి సిద్ధం

# tapMicToStartTalking
source: Tap the mic to start talking with Krishi Sakhi
bn: কৃষি সখীর সাথে কথা বলতে মাইক্রোফোনে ট্যাপ করুন
kn: ಕೃಷಿ ಸಖಿಯೊಂದಿಗೆ ಮಾತನಾಡಲು ಮೈಕ್‌ನ್ನು ಟ್ಯಾಪ್ ಮಾಡಿ
ml: കൃഷി സഖിയുമായി സംസാരിക്കാൻ മൈക്രോഫോൺ ടാപ്പ് ചെയ്യുക
pa: ਕ੍ਰਿਸ਼ੀ ਸਖੀ ਨਾਲ ਗੱਲ ਕਰਨ ਲਈ ਮਾਈਕ ਨੂੰ ਟੈਪ ਕਰੋ
ta: கிருஷி சகியுடன் பேச மைக்ரோபோனை தட்டவும்
te: కృషి సఖితో మాట్లాడటానికి మైక్‌ను టాప్ చేయండి

source: Thinking...
bn: ভাবছি...
kn: ಯೋಚಿಸುತ್ತಿದ್ದೇನೆ...
ml: ചിന്തിക്കുന്നു...
pa: ਸੋਚ ਰਿਹਾ ਹਾਂ...
ta: யோசிக்கிறேன்...
te: ఆలోచిస్తున్నాను...

# speakingInterrupt
source: Speaking (Tap mic to interrupt)
bn: কথা বলছি (বাধা দেওয়ার জন্য মাইক ট্যাপ করুন)
kn: ಮಾತನಾಡುತ್ತಿದ್ದೇನೆ (ತಡೆಯಲು ಮೈಕ್ ಟ್ಯಾಪ್ ಮಾಡಿ)
ml: സംസാരിക്കുന്നു (തടസ്സപ്പെടുത്താൻ മൈക്ക് ടാപ്പ് ചെയ്യുക)
pa: ਬੋਲ ਰਿਹਾ ਹਾਂ (ਰੁਕਾਵਟ ਪਾਉਣ ਲਈ ਮਾਈਕ ਟੈਪ ਕਰੋ)
ta: பேசுகிறேன் (தடை செய்ய மைக் தட்டவும்)
te: మాట్లాడుతున్నాను (అంతరాయం కలిగించడానికి మైక్‌ను టాప్ చేయండి)

source: Speak now...
bn: এখন কথা বলুন
kn: ಈಗ ಮಾತನಾಡಿ
ml: ഇപ്പോൾ സംസാരിക്കുക...
pa: ਹੁਣ ਬੋਲੋ
ta: இப்போது பேசுங்கள்
te: ఇప్పుడు మాట్లాడండి

# gettingAnswer
source: Getting your answer...
bn: আপনার উত্তর পাচ্ছি...
kn: ನಿಮ್ಮ ಉತ್ತರವನ್ನು ಪಡೆಯುತ್ತಿದ್ದೇನೆ...
ml: നിങ്ങളുടെ ഉത്തരം കിട്ടുന്നു...
pa: ਤੁਹਾਡਾ ਜਵਾਬ ਲੈ ਰਿਹਾ ਹਾਂ...
ta: உங்கள் பதிலைப் பெறுகிறேன்...
te: మీ సమాధానం పొందుతున్నాను...

source: Speaking...
bn: কথা বলছি...
kn: ಮಾತನಾಡುತ್ತಿದ್ದೇನೆ...
ml: സംസാരിക്കുന്നു...
pa: ਬੋਲ ਰਿਹਾ ਹਾਂ...
ta: பேசுகிறேன்...
te: మాట్లాడుతున్నాను...

source: Text Chat
bn: টেক্সট চ্যাট
kn: ಟೆಕ್ಸ್ಟ್ ಚಾಟ್
ml: ടെക്സ്റ്റ് ചാറ്റ്
pa: ਟੈਕਸਟ ਚੈਟ
ta: உரை அரட்டை
te: టెక్స్ట్ చాట్

# onboardingTitle1
source: Welcome to Krishi Sakhi
bn: কৃষি সখীতে স্বাগতম
kn: ಕೃಷಿ ಸಖಿಗೆ ಸ್ವಾಗತ
ml: കൃഷി സഖിയിലേക്ക് സ്വാഗതം
pa: ਕ੍ਰਿਸ਼ੀ ਸਖੀ ਵਿੱਚ ਜੀ ਆਇਆਂ ਨੂੰ
ta: கிருஷி சகிக்கு வரவேற்கிறோம்
te: కృషి సఖికి స్వాగతం

# onboardingSubtitle1
source: Your agricultural companion for farming solutions
bn: কৃষি সমাধানের জন্য আপনার কৃষি সহায়ক
kn: ಕೃಷಿ ಪರಿಹಾರಗಳಿಗಾಗಿ ನಿಮ್ಮ ಕೃಷಿ ಸಹಾಯಕ
ml: കൃഷി പരിഹാരങ്ങൾക്കായുള്ള നിങ്ങളുടെ കാർഷിക സഹായി
pa: ਖੇਤੀ ਹੱਲਾਂ ਲਈ ਤੁਹਾਡਾ ਖੇਤੀ ਸਹਾਇਕ
ta: விவசாய தீர்வுகளுக்கான உங்கள் விவசாய உதவியாளர்
te: వ్యవసాయ పరిష్కారాల కోసం మీ వ్యవసాయ సహాయకుడు

# onboardingTitle2
source: Voice Recognition
bn: ভয়েস রিকগনিশন
kn: ಧ್ವನಿ ಗುರುತಿಸುವಿಕೆ
ml: ശബ്ദ തിരിച്ചറിയൽ
pa: ਆਵਾਜ਼ ਪਛਾਣ
ta: குரல் அடையாளம்
te: వాయిస్ రికగ్నిషన్

# onboardingSubtitle2
source: Speak in your preferred language to get instant help
bn: তাৎক্ষণিক সাহায্যের জন্য আপনার পছন্দের ভাষায় কথা বলুন
kn: ತತ್ಕ್ಷಣ ಸಹಾಯಕ್ಕಾಗಿ ನಿಮ್ಮ ಇಷ್ಟದ ಭಾಷೆಯಲ್ಲಿ ಮಾತನಾಡಿ
ml: തൽക്ഷണ സഹായത്തിനായി നിങ്ങളുടെ ഇഷ്ടമുള്ള ഭാഷയിൽ സംസാരിക്കുക
pa: ਤੁਰੰਤ ਮਦਦ ਲਈ ਆਪਣੀ ਪਸੰਦੀਦਾ ਭਾਸ਼ਾ ਵਿੱਚ ਬੋਲੋ
ta: உடனடி உதவிக்காக உங்கள் விருப்பமான மொழியில் பேசுங்கள்
te: తక్షణ సహాయం కోసం మీ ఇష్టమైన భాషలో మాట్లాడండి

# onboardingTitle3
source: Chat Support
bn: চ্যাট সাপোর্ট
kn: ಚಾಟ್ ಬೆಂಬಲ
ml: ചാറ്റ് പിന്തുണ
pa: ਚੈਟ ਸਪੋਰਟ
ta: அரட்டை ஆதரவு
te: చాట్ సపోర్ట్

# onboardingSubtitle3
source: Get expert advice through our intelligent chat system
bn: আমাদের স্মার্ট চ্যাট সিস্টেমের মাধ্যমে বিশেষজ্ঞ পরামর্শ নিন
kn: ನಮ್ಮ ಸ್ಮಾರ್ಟ್ ಚಾಟ್ ಸಿಸ್ಟಂನ ಮೂಲಕ ತಜ್ಞರ ಸಲಹೆ ಪಡೆಯಿರಿ
ml: ഞങ്ങളുടെ ബുദ്ധിപരമായ ചാറ്റ് സിസ്റ്റത്തിലൂടെ വിദഗ്ധ ഉപദേശം നേടുക
pa: ਸਾਡੇ ਸਮਾਰਟ ਚੈਟ ਸਿਸਟਮ ਰਾਹੀਂ ਮਾਹਰਾਂ ਦੀ ਸਲਾਹ ਲਓ
ta: எங்கள் ஸ்மார்ட் அரட்டை அமைப்பு மூலம் நிபுணர் ஆலோசனை பெறுங்கள்
te: మా స్మార్ట్ చాట్ సిస్టం ద్వారా నిపుణుల సలహా పొందండి

# onboardingSkip
source: Skip
bn: এড়িয়ে যান
kn: ಬಿಟ್ಟುಬಿಡಿ
ml: ഒഴിവാക്കുക
pa: ਛੱਡੋ
ta: தவிர்க்கவும்
te: దాటవేయండి

# onboardingNext
source: Next
bn: পরবর্তী
kn: ಮುಂದೆ
ml: അടുത്തത്
pa: ਅਗਲਾ
ta: அடுத்து
te: తదుపరి

# onboardingGetStarted
source: Get Started
bn: শুরু করুন
kn: ಪ್ರಾರಂಭಿಸಿ
ml: ആരംഭിക്കുക
pa: ਸ਼ੁਰੂ ਕਰੋ
ta: தொடங்குங்கள்
te: ప్రారంభించండి

source: Setup Profile
bn: প্রোফাইল সেটআপ
kn: ಪ್ರೊಫೈಲ್ ಸೆಟಪ್
ml: പ്രൊഫൈൽ സെറ്റപ്പ്
pa: ਪ੍ਰੋਫਾਈਲ ਸੈਟਅੱਪ
ta: சுயவிவர அமைப்பு
te: ప్రొఫైల్ సెటప్

# enterMobileNumber
source: Please enter mobile number
bn: অনুগ্রহ করে মোবাইল নম্বর দিন
kn: ದಯವಿಟ್ಟು ಮೊಬೈಲ್ ಸಂಖ್ಯೆ ನಮೂದಿಸಿ
ml: ദയവായി മൊബൈൽ നമ്പർ നൽകുക
pa: ਕਿਰਪਾ ਕਰਕੇ ਮੋਬਾਇਲ ਨੰਬਰ ਦਾਖਲ ਕਰੋ
ta: மொபைல் எண்ணை உள்ளிடவும்
te: దయచేసి మొబైల్ నంబర్ నమోదు చేయండి

# invalidMobileNumber
source: Please enter valid mobile number
bn: অনুগ্রহ করে বৈধ মোবাইল নম্বর দিন
kn: ದಯವಿಟ್ಟು ಮಾನ್ಯವಾದ ಮೊಬೈಲ್ ಸಂಖ್ಯೆ ನಮೂದಿಸಿ
ml: ദയവായി സാധുവായ മൊബൈൽ നമ്പർ നൽകുക
pa: ਕਿਰਪਾ ਕਰਕੇ ਸਹੀ ਮੋਬਾਇਲ ਨੰਬਰ ਦਾਖਲ ਕਰੋ
ta: சரியான மொபைல் எண்ணை உள்ளிடவும்
te: దయచేసి చెల్లుబాటు అయ్యే మొబైల్ నంబర్ నమోదు చేయండి

source: Error
bn: ত্রুটি
kn: ದೋಷ
ml: പിശക്
pa: ਗਲਤੀ
ta: பிழை
te: లోపం

# progressOf
source: of
bn: এর
kn: ರ
ml: ന്റെ
pa: ਦਾ
ta: இன்
te: లో

source: Previous
bn: পূর্ববর্তী
kn: ಹಿಂದಿನ
ml: മുമ്പത്തെ
pa: ਪਿਛਲਾ
ta: முந்தைய
te: మునుపటి

source: Next
bn: পরবর্তী
kn: ಮುಂದೆ
ml: അടുത്തത്
pa: ਅਗਲਾ
ta: அடுத்து
te: తదుపరి

source: Complete
bn: সম্পন্ন করুন
kn: ಪೂರ್ಣಗೊಳಿಸಿ
ml: പൂർത്തിയാക്കുക
pa: ਪੂਰਾ ਕਰੋ
ta: முடிக்கவும்
te: పూర్తి చేయండి

# setupCompleteTitle
source: Setup Complete!
bn: সেটআপ সম্পন্ন!
kn: ಸೆಟಪ್ ಪೂರ್ಣಗೊಂಡಿದೆ!
ml: സെറ്റപ്പ് പൂർത്തിയായി!
pa: ਸੈਟਅੱਪ ਪੂਰਾ!
ta: அமைப்பு முடிந்தது!
te: సెటప్ పూర్తయ్యింది!

# profileCreatedMessage
source: Your profile has been created successfully.
bn: আপনার প্রোফাইল সফলভাবে তৈরি হয়েছে।
kn: ನಿಮ್ಮ ಪ್ರೊಫೈಲ್ ಯಶಸ್ವಿಯಾಗಿ ರಚಿಸಲಾಗಿದೆ.
ml: നിങ്ങളുടെ പ്രൊഫൈൽ വിജയകരമായി സൃഷ്ടിച്ചു.
pa: ਤੁਹਾਡਾ ਪ੍ਰੋਫਾਈਲ ਸਫਲਤਾ ਨਾਲ ਬਣਾਇਆ ਗਿਆ ਹੈ।
ta: உங்கள் சுயவிவரம் வெற்றிகரமாக உருவாக்கப்பட்டது.
te: మీ ప్రొఫైల్ విజయవంతంగా సృష్టించబడింది.

# continueButton
source: Continue
bn: চালিয়ে যান
kn: ಮುಂದುವರಿಸಿ
ml: തുടരുക
pa: ਜਾਰੀ ਰੱਖੋ
ta: தொடரவும்
te: కొనసాగించండి

# errorTitle
source: Error
bn: ত্রুটি
kn: ದೋಷ
ml: പിശക്
pa: ਗਲਤੀ
ta: பிழை
te: లోపం

# saveFailedMessage
source: Failed to save profile. Please try again.
bn: প্রোফাইল সংরক্ষণে ব্যর্থ। অনুগ্রহ করে আবার চেষ্টা করুন।
kn: ಪ್ರೊಫೈಲ್ ಉಳಿಸಲು ವಿಫಲವಾಗಿದೆ. ದಯವಿಟ್ಟು ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ.
ml: പ്രൊഫൈൽ സേവ് ചെയ്യുന്നതിൽ പരാജയപ്പെട്ടു. ദയവായി വീണ്ടും ശ്രമിക്കുക.
pa: ਪ੍ਰੋਫਾਈਲ ਸੇਵ ਕਰਨ ਵਿੱਚ ਅਸਫਲ। ਕਿਰਪਾ ਕਰਕੇ ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
ta: சுயவிவரத்தை சேமிக்க முடியவில்லை. மீண்டும் முயற்சிக்கவும்.
te: ప్రొఫైల్ సేవ్ చేయడంలో విఫలమైంది. దయచేసి మళ్లీ ప్రయత్నించండి.

# questionName
source: What is your name?
bn: আপনার নাম কী?
kn: ನಿಮ್ಮ ಹೆಸರೇನು?
ml: നിങ്ങളുടെ പേര് എന്താണ്?
pa: ਤੁਹਾਡਾ ਨਾਮ ਕੀ ਹੈ?
ta: உங்கள் பெயர் என்ன?
te: మీ పేరు ఏమిటి?

# questionLocality
source: What is your locality?
bn: আপনার এলাকা কী?
kn: ನಿಮ್ಮ ಪ್ರದೇಶವೇನು?
ml: നിങ്ങളുടെ പ്രദേശം എന്താണ്?
pa: ਤੁਹਾਡਾ ਇਲਾਕਾ ਕੀ ਹੈ?
ta: உங்கள் பகுதி என்ன?
te: మీ ప్రాంతం ఏమిటి?

# questionLandArea
source: What is your land area?
bn: আপনার জমির পরিমাণ কত?
kn: ನಿಮ್ಮ ಭೂಮಿಯ ವಿಸ್ತೀರ್ಣ ಎಷ್ಟು?
ml: നിങ്ങളുടെ ഭൂവിസ്തൃതി എത്രയാണ്?
pa: ਤੁਹਾਡੀ ਜ਼ਮੀਨ ਦਾ ਰਕਬਾ ਕਿੰਨਾ ਹੈ?
ta: உங்கள் நில பரப்பளவு என்ன?
te: మీ భూమి విస్తీర్ణం ఎంత?

# questionTypesOfCrops
source: What types of crops do you grow?
bn: আপনি কী ধরনের ফসল চাষ করেন?
kn: ನೀವು ಯಾವ ರೀತಿಯ ಬೆಳೆಗಳನ್ನು ಬೆಳೆಯುತ್ತೀರಿ?
ml: നിങ്ങൾ ഏതുതരം വിളകൾ കൃഷി ചെയ്യുന്നു?
pa: ਤੁਸੀਂ ਕਿਸ ਕਿਸਮ ਦੀਆਂ ਫਸਲਾਂ ਉਗਾਉਂਦੇ ਹੋ?
ta: நீங்கள் எந்த வகையான பயிர்களை வளர்க்கிறீர்கள்?
te: మీరు ఎలాంటి పంటలు పండిస్తారు?

# questionFertilizersAndChemicals
source: What fertilizers and chemicals do you use?
bn: আপনি কী ধরনের সার ও রাসায়নিক ব্যবহার করেন?
kn: ನೀವು ಯಾವ ರೀತಿಯ ರಸಗೊಬ್ಬರ ಮತ್ತು ರಾಸಾಯನಿಕಗಳನ್ನು ಬಳಸುತ್ತೀರಿ?
ml: നിങ്ങൾ ഏതുതരം വളങ്ങളും രാസവസ്തുക്കളും ഉപയോഗിക്കുന്നു?
pa: ਤੁਸੀਂ ਕਿਸ ਕਿਸਮ ਦੀਆਂ ਖਾਦਾਂ ਅਤੇ ਰਸਾਇਣਾਂ ਦੀ ਵਰਤੋਂ ਕਰਦੇ ਹੋ?
ta: நீங்கள் எந்த வகையான உரங்கள் மற்றும் இரசாயனங்களைப் பயன்படுத்துகிறீர்கள்?
te: మీరు ఎలాంటి ఎరువులు మరియు రసాయనాలు ఉపయోగిస్తారు?

# questionSourceOfIrrigation
source: What is your source of irrigation?
bn: আপনার সেচের উৎস কী?
kn: ನಿಮ್ಮ ನೀರಾವರಿ ಮೂಲ ಏನು?
ml: നിങ്ങളുടെ ജലസേചനത്തിന്റെ ഉറവിടം എന്താണ്?
pa: ਤੁਹਾਡੇ ਸਿੰਚਾਈ ਦਾ ਸਰੋਤ ਕੀ ਹੈ?
ta: உங்கள் நீர்ப்பாசன ஆதாரம் என்ன?
te: మీ నీటిపారుదల మూలం ఏమిటి?

# questionNumberOfCrops
source: How many crops do you grow per year?
bn: আপনি বছরে কতটি ফসল চাষ করেন?
kn: ನೀವು ವರ್ಷಕ್ಕೆ ಎಷ್ಟು ಬೆಳೆಗಳನ್ನು ಬೆಳೆಯುತ್ತೀರಿ?
ml: നിങ്ങൾ വർഷത്തിൽ എത്ര വിളകൾ കൃഷി ചെയ്യുന്നു?
pa: ਤੁਸੀਂ ਸਾਲ ਵਿੱਚ ਕਿੰਨੀਆਂ ਫਸਲਾਂ ਉਗਾਉਂਦੇ ਹੋ?
ta: நீங்கள் ஆண்டுக்கு எத்தனை பயிர்களை வளர்க்கிறீர்கள்?
te: మీరు సంవత్సరానికి ఎన్ని పంటలు పండిస్తారు?

# questionEmail
source: What is your email address?
bn: আপনার ইমেইল ঠিকানা কী?
kn: ನಿಮ್ಮ ಇಮೇಲ್ ವಿಳಾಸ ಏನು?
ml: നിങ്ങളുടെ ഇമെയിൽ വിലാസം എന്താണ്?
pa: ਤੁਹਾਡਾ ਈਮੇਲ ਪਤਾ ਕੀ ਹੈ?
ta: உங்கள் மின்னஞ்சல் முகவரி என்ன?
te: మీ ఇమెయిల్ చిరునామా ఏమిటి?

# questionPhone
source: What is your phone number?
bn: আপনার ফোন নম্বর কী?
kn: ನಿಮ್ಮ ಫೋನ್ ಸಂಖ್ಯೆ ಏನು?
ml: നിങ്ങളുടെ ഫോൺ നമ്പർ എന്താണ്?
pa: ਤੁਹਾਡਾ ਫੋਨ ਨੰਬਰ ਕੀ ਹੈ?
ta: உங்கள் தொலைபேசி எண் என்ன?
te: మీ ఫోన్ నంబర్ ఏమిటి?

# questionPreference
source: What is your preference?
bn: আপনার পছন্দ কী?
kn: ನಿಮ್ಮ ಆದ್ಯತೆ ಏನು?
ml: നിങ്ങളുടെ മുൻഗണന എന്താണ്?
pa: ਤੁਹਾਡੀ ਤਰਜੀਹ ਕੀ ਹੈ?
ta: உங்கள் விருப்பம் என்ன?
te: మీ ప్రాధాన్యం ఏమిటి?

# questionLanguage
source: What is your preferred language?
bn: আপনার পছন্দের ভাষা কী?
kn: ನಿಮ್ಮ ಆದ್ಯತೆಯ ಭಾಷೆ ಏನು?
ml: നിങ്ങളുടെ ഇഷ്ട ഭാഷ ഏതാണ്?
pa: ਤੁਹਾਡੀ ਪਸੰਦੀਦਾ ਭਾਸ਼ਾ ਕੀ ਹੈ?
ta: உங்கள் விருப்பமான மொழி என்ன?
te: మీ అభీష్ట భాష ఏమిటి?

# optionText
source: Text
bn: টেক্সট
kn: ಪಠ್ಯ
ml: ടെക്സ്റ്റ്
pa: ਲਿਖਤ
ta: உரை
te: టెక్స్ట్

# optionVoice
source: Voice
bn: ভয়েস
kn: ಧ್ವನಿ
ml: ശബ്ദം
pa: ਆਵਾਜ਼
ta: குரல்
te: వాయిస్

# optionEnglish
source: English
bn: ইংরেজি
kn: ಇಂಗ್ಲಿಷ್
ml: ഇംഗ്ലീഷ്
pa: ਅੰਗਰੇਜ਼ੀ
ta: ஆங்கிலம்
te: ఇంగ్లీష్

# optionMalayalam
source: Malayalam
bn: মালয়ালম
kn: ಮಲಯಾಳಂ
ml: മലയാളം
pa: ਮਲਿਆਲਮ
ta: மலையாளம்
te: మలయాళం

# placeholderName
source: Enter your name
bn: আপনার নাম লিখুন
kn: ನಿಮ್ಮ ಹೆಸರನ್ನು ನಮೂದಿಸಿ
ml: നിങ്ങളുടെ പേര് നൽകുക
pa: ਆਪਣਾ ਨਾਮ ਦਰਜ ਕਰੋ
ta: உங்கள் பெயரை உள்ளீடு செய்யுங்கள்
te: మీ పేరు నమోదు చేయండి

# placeholderLocality
source: Enter your locality
bn: আপনার এলাকা লিখুন
kn: ನಿಮ್ಮ ಪ್ರದೇಶವನ್ನು ನಮೂದಿಸಿ
ml: നിങ്ങളുടെ പ്രദേശം നൽകുക
pa: ਆਪਣੀ ਥਾਂ ਦਰਜ ਕਰੋ
ta: உங்கள் இடத்தை உள்ளீடு செய்யுங்கள்
te: మీ ప్రాంతాన్ని నమోదు చేయండి

# placeholderLandArea
source: Enter land area (in acres)
bn: জমির আয়তন লিখুন (একরে)
kn: ಭೂಪ್ರದೇಶವನ್ನು ನಮೂದಿಸಿ (ಎಕರೆಗಳಲ್ಲಿ)
ml: ഭൂവിസ്തൃതി നൽകുക (ഏക്കറിൽ)
pa: ਜ਼ਮੀਨ ਦਾ ਖੇਤਰ ਦਰਜ ਕਰੋ (ਏਕੜ ਵਿੱਚ)
ta: நிலப் பரப்பை உள்ளீடு செய்யுங்கள் (ஏக்கரில்)
te: భూభాగాన్ని నమోదు చేయండి (ఎకరాలలో)

# placeholderTypesOfCrops
source: Enter types of crops
bn: ফসলের ধরন লিখুন
kn: ಬೆಳೆಗಳ ಪ್ರಕಾರಗಳನ್ನು ನಮೂದಿಸಿ
ml: വിളകളുടെ തരങ്ങൾ നൽകുക
pa: ਫਸਲਾਂ ਦੇ ਕਿਸਮਾਂ ਦਰਜ ਕਰੋ
ta: பயிர் வகைகளை உள்ளீடு செய்யுங்கள்
te: పంటల రకాలను నమోదు చేయండి

# placeholderFertilizersAndChemicals
source: Enter fertilizers and chemicals used
bn: ব্যবহৃত সার এবং রাসায়নিক লিখুন
kn: ಬಳಸುವ ರಸಗೊಬ್ಬರಗಳು ಮತ್ತು ರಾಸಾಯನಿಕಗಳನ್ನು ನಮೂದಿಸಿ
ml: ഉപയോഗിക്കുന്ന വളങ്ങളും രാസവസ്തുക്കളും നൽകുക
pa: ਵਰਤੇ ਜਾਣ ਵਾਲੇ ਖਾਦ ਅਤੇ ਰਸਾਇਣਕ ਦਰਜ ਕਰੋ
ta: பயன்படுத்தப்படும் உரங்கள் மற்றும் வேதியியல் பொருட்களை உள்ளீடு செய்யுங்கள்
te: వాడే ఎరువులు మరియు రసాయనాలను నమోదు చేయండి

# placeholderSourceOfIrrigation
source: Enter source of irrigation
bn: সেচের উৎস লিখুন
kn: ನೀರಾವರಿ ಮೂಲವನ್ನು ನಮೂದಿಸಿ
ml: ജലസേചനത്തിന്റെ ഉറവിടം നൽകുക
pa: ਸਿੰਚਾਈ ਦਾ ਸਰੋਤ ਦਰਜ ਕਰੋ
ta: நீர்ப்பாசன மூலத்தை உள்ளீடு செய்யுங்கள்
te: నీటిపారుదల మూలాన్ని నమోదు చేయండి

# placeholderNumberOfCrops
source: Enter number of crops per year
bn: বছরে ফসলের সংখ্যা লিখুন
kn: ವರ್ಷಕ್ಕೆ ಬೆಳೆಗಳ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ
ml: വർഷത്തിലെ വിളകളുടെ എണ്ണം നൽകുക
pa: ਸਾਲ ਵਿੱਚ ਫਸਲਾਂ ਦੀ ਗਿਣਤੀ ਦਰਜ ਕਰੋ
ta: ஆண்டுக்கு பயிர் எண்ணிக்கையை உள்ளீடு செய்யுங்கள்
te: సంవత్సరానికి పంటల సంఖ్యను నమోదు చేయండి

# placeholderEmail
source: Enter your email
bn: আপনার ইমেইল লিখুন
kn: ನಿಮ್ಮ ಇಮೇಲ್ ನಮೂದಿಸಿ
ml: നിങ്ങളുടെ ഇമെയിൽ നൽകുക
pa: ਆਪਣਾ ਈਮੇਲ ਦਰਜ ਕਰੋ
ta: உங்கள் மின்னஞ்சலை உள்ளீடு செய்யுங்கள்
te: మీ ఇమెయిల్ నమోదు చేయండి

# placeholderPhone
source: Enter your phone number
bn: আপনার ফোন নম্বর লিখুন
kn: ನಿಮ್ಮ ಫೋನ್ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ
ml: നിങ്ങളുടെ ഫോൺ നമ്പർ നൽകുക
pa: ਆਪਣਾ ਫੋਨ ਨੰਬਰ ਦਰਜ ਕਰੋ
ta: உங்கள் தொலைபேசி எண்ணை உள்ளீடு செய்யுங்கள்
te: మీ ఫోన్ నంబర్ నమోదు చేయండి

# voiceStartListening
source: Start Listening
bn: শোনা শুরু করুন
kn: ಕೇಳುವುದನ್ನು ಪ್ರಾರಂಭಿಸಿ
ml: കേൾക്കൽ ആരംഭിക്കുക
pa: ਸੁਣਨਾ ਸ਼ੁਰੂ ਕਰੋ
ta: கேட்கத் தொடங்கு
te: వినడం ప్రారంభించు

# voiceStopListening
source: Stop Listening
bn: শোনা বন্ধ করুন
kn: ಕೇಳುವುದನ್ನು ನಿಲ್ಲಿಸಿ
ml: കേൾക്കൽ നിർത്തുക
pa: ਸੁਣਨਾ ਬੰਦ ਕਰੋ
ta: கேட்க நிறுத்து
te: వినడం ఆపు

# voiceListening
source: Listening...
bn: শোনা হচ্ছে...
kn: ಕೇಳುತ್ತಿದೆ...
ml: കേൾക്കുന്നു...
pa: ਸੁਣ ਰਿਹਾ ਹੈ...
ta: கேட்கிறது...
te: వింటోంది...

# voiceNoSpeechDetected
source: No speech detected
bn: কোনো কথা শনাক্ত হয়নি
kn: ಯಾವುದೇ ಮಾತು ಕಂಡುಬಂದಿಲ್ಲ
ml: സംസാരം കണ്ടെത്തിയില്ല
pa: ਕੋਈ ਬੋਲੀ ਨਹੀਂ ਮਿਲੀ
ta: பேச்சு எதுவும் கண்டறியப்படவில்லை
te: మాటలు ఏవీ కనుగొనబడలేదు

# voiceConfidence
source: Confidence: {confidence}%
bn: আত্মবিশ্বাস: {confidence}%
kn: ವಿಶ್ವಾಸ: {confidence}%
ml: ആത്മവിശ്വാസം: {confidence}%
pa: ਭਰੋਸਾ: {confidence}%
ta: நம்பிக்கை: {confidence}%
te: విశ్వాసం: {confidence}%

# voiceSpeakToBegin
source: Tap the microphone to speak
bn: কথা বলতে মাইক্রোফোন ট্যাপ করুন
kn: ಮಾತನಾಡಲು ಮೈಕ್ರೋಫೋನ್ ಅನ್ನು ಟ್ಯಾಪ್ ಮಾಡಿ
ml: സംസാരിക്കാൻ മൈക്രോഫോൺ ടാപ്പ് ചെയ്യുക
pa: ਬੋਲਣ ਲਈ ਮਾਈਕ੍ਰੋਫ਼ੋਨ ਨੂੰ ਟੈਪ ਕਰੋ
ta: பேச மைக்ரோஃபோனைத் தட்டவும்
te: మాట్లాడటానికి మైక్రోఫోన్ నొక్కండి

# voiceTranscription
source: Transcription
bn: ট্রান্সক্রিপশন
kn: ಪ್ರತಿಲಿಪಿ
ml: ട്രാൻസ്ക്രിപ്ഷൻ
pa: ਲਿਪੀਕਰਨ
ta: பதிவு
te: ట్రాన్స్క్రిప్షన్

# voiceClearTranscription
source: Clear
bn: সাফ করুন
kn: ತೆರವುಗೊಳಿಸಿ
ml: മായ്ക്കുക
pa: ਸਾਫ਼ ਕਰੋ
ta: தெளிவுசெய்
te: తొలగించు

# voicePlayTranscription
source: Play
bn: চালান
kn: ಪ್ಲೇ ಮಾಡಿ
ml: പ്ലേ ചെയ്യുക
pa: ਚਲਾਓ
ta: இயக்கு
te: ప్లే చేయు

# chatTypeMessage
source: Type your message...
bn: আপনার বার্তা টাইপ করুন...
kn: ನಿಮ್ಮ ಸಂದೇಶವನ್ನು ಟೈಪ್ ಮಾಡಿ...
ml: നിങ്ങളുടെ സന്ദേശം ടൈപ്പ് ചെയ്യുക...
pa: ਆਪਣਾ ਸੁਨੇਹਾ ਟਾਈਪ ਕਰੋ...
ta: உங்கள் செய்தியைத் தட்டச்சு செய்யுங்கள்...
te: మీ సందేశాన్ని టైప్ చేయండి...

# chatSend
source: Send
bn: পাঠান
kn: ಕಳುಹಿಸಿ
ml: അയയ്ക്കുക
pa: ਭੇਜੋ
ta: அனுப்பு
te: పంపు

# chatLoading
source: Loading...
bn: লোড হচ্ছে...
kn: ಲೋಡ್ ಆಗುತ್ತಿದೆ...
ml: ലോഡിംഗ്...
pa: ਲੋਡ ਹੋ ਰਿਹਾ ਹੈ...
ta: ஏற்றுகிறது...
te: లోడ్ అవుతోంది...

# chatError
source: Error sending message
bn: বার্তা পাঠাতে ত্রুটি
kn: ಸಂದೇಶ ಕಳುಹಿಸುವಲ್ಲಿ ದೋಷ
ml: സന്ദേശം അയയ്ക്കുന്നതിൽ പിശക്
pa: ਸੁਨੇਹਾ ਭੇਜਣ ਵਿੱਚ ਗਲਤੀ
ta: செய்தி அனுப்புவதில் பிழை
te: సందేశం పంపడంలో లోపం

# chatRetry
source: Retry
bn: পুনরায় চেষ্টা করুন
kn: ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ
ml: വീണ്ടും ശ്രമിക്കുക
pa: ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ
ta: மீண்டும் முயற்சி செய்
te: మళ్లీ ప్రయత్నించు

# chatNoMessages
source: No messages yet
bn: এখনও কোনো বার্তা নেই
kn: ಇನ್ನೂ ಯಾವುದೇ ಸಂದೇಶಗಳಿಲ್ಲ
ml: ഇതുവരെ സന്ദേശങ്ങളൊന്നുമില്ല
pa: ਅਜੇ ਕੋਈ ਸੁਨੇਹੇ ਨਹੀਂ
ta: இன்னும் செய்திகள் இல்லை
te: ఇంకా సందేశాలు లేవు

# settingsGeneral
source: General
bn: সাধারণ
kn: ಸಾಮಾನ್ಯ
ml: പൊതുവായ
pa: ਆਮ
ta: பொதுவானது
te: సాధారణ

# settingsNotifications
source: Notifications
bn: বিজ্ঞপ্তি
kn: ಅಧಿಸೂಚನೆಗಳು
ml: അറിയിപ്പുകൾ
pa: ਨੋਟੀਫਿਕੇਸ਼ਨ
ta: அறிவிப்புகள்
te: నోటిఫికేషన్లు

# settingsAbout
source: About
bn: সম্পর্কে
kn: ಕುರಿತು
ml: കുറിച്ച്
pa: ਬਾਰੇ
ta: பற்றி
te: గురించి

# settingsVersion
source: Version
bn: সংস্করণ
kn: ಆವೃತ್ತಿ
ml: പതിപ്പ്
pa: ਵਰਜਨ
ta: பதிப்பு
te: వెర్షన్

# settingsPrivacyPolicy
source: Privacy Policy
bn: গোপনীয়তা নীতি
kn: ಗೌಪ್ಯತೆ ನೀತಿ
ml: സ്വകാര്യതാ നയം
pa: ਪ੍ਰਾਈਵੇਸੀ ਪਾਲਿਸੀ
ta: தனியுரிமைக் கொள்கை
te: ప్రైవసీ పాలసీ

# settingsTermsOfService
source: Terms of Service
bn: পরিষেবার শর্তাবলী
kn: ಸೇವಾ ನಿಯಮಗಳು
ml: സേവന നിബന്ധനകൾ
pa: ਸੇਵਾ ਦੀਆਂ ਸ਼ਰਤਾਂ
ta: சேவை விதிமுறைகள்
te: సేవా నిబంధనలు

# commonSave
source: Save
bn: সংরক্ষণ করুন
kn: ಉಳಿಸಿ
ml: സംരക്ഷിക്കുക
pa: ਸੇਵ ਕਰੋ
ta: சேமி
te: సేవ్ చేయు

# commonCancel
source: Cancel
bn: বাতিল করুন
kn: ರದ್ದುಗೊಳಿಸಿ
ml: റദ്ദാക്കുക
pa: ਰੱਦ ਕਰੋ
ta: ரத்து செய்
te: రద్దు చేయు

# commonDelete
source: Delete
bn: মুছুন
kn: ಅಳಿಸಿ
ml: ഇല്ലാതാക്കുക
pa: ਮਿਟਾਓ
ta: நீக்கு
te: తొలగించు

# commonEdit
source: Edit
bn: সম্পাদনা করুন
kn: ಸಂಪಾದಿಸಿ
ml: എഡിറ്റ് ചെയ്യുക
pa: ਸੰਪਾਦਿਤ ਕਰੋ
ta: திருத்து
te: సవరించు

# commonBack
source: Back
bn: পিছনে
kn: ಹಿಂದೆ
ml: പിന്നോട്ട്
pa: ਵਾਪਸ
ta: பின்னால்
te: వెనుకకు

# commonContinue
source: Continue
bn: চালিয়ে যান
kn: ಮುಂದುವರಿಸಿ
ml: തുടരുക
pa: ਜਾਰੀ ਰੱਖੋ
ta: தொடர்ந்து
te: కొనసాగించు

# commonLoading
source: Loading...
bn: লোড হচ্ছে...
kn: ಲೋಡ್ ಆಗುತ್ತಿದೆ...
ml: ലോഡിംഗ്...
pa: ਲੋਡ ਹੋ ਰਿਹਾ ਹੈ...
ta: ஏற்றுகிறது...
te: లోడ్ అవుతోంది...

# commonError
source: Error
bn: ত্রুটি
kn: ದೋಷ
ml: പിശക്
pa: ਗਲਤੀ
ta: பிழை
te: లోపం

# commonSuccess
source: Success
bn: সাফল্য
kn: ಯಶಸ್ಸು
ml: വിജയം
pa: ਸਫਲਤਾ
ta: வெற்றி
te: విజయం

# commonRetry
source: Retry
bn: পুনরায় চেষ্টা করুন
kn: ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ
ml: വീണ്ടും ശ്രമിക്കുക
pa: ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ
ta: மீண்டும் முயற்சி செய்
te: మళ్లీ ప్రయత్నించు

# commonOk
source: OK
bn: ঠিক আছে
kn: ಸರಿ
ml: ശരി
pa: ਠੀਕ ਹੈ
ta: சரி
te: సరే

# errorNetworkError
source: Network error. Please check your connection.
bn: নেটওয়ার্ক ত্রুটি। অনুগ্রহ করে আপনার সংযোগ পরীক্ষা করুন।
kn: ನೆಟ್‌ವರ್ಕ್ ದೋಷ. ದಯವಿಟ್ಟು ನಿಮ್ಮ ಸಂಪರ್ಕವನ್ನು ಪರಿಶೀಲಿಸಿ.
ml: നെറ്റ്‌വർക്ക് പിശക്. നിങ്ങളുടെ കണക്ഷൻ പരിശോധിക്കുക.
pa: ਨੈੱਟਵਰਕ ਗਲਤੀ। ਕਿਰਪਾ ਕਰਕੇ ਆਪਣਾ ਕਨੈਕਸ਼ਨ ਚੈਕ ਕਰੋ।
ta: பிணையப் பிழை. உங்கள் இணைப்பைச் சரிபார்க்கவும்.
te: నెట్వర్క్ లోపం. మీ కనెక్షన్ తనిఖీ చేయండి.

# errorPermissionDenied
source: Permission denied
bn: অনুমতি অস্বীকার করা হয়েছে
kn: ಅನುಮತಿ ನಿರಾಕರಿಸಲಾಗಿದೆ
ml: അനുമതി നിഷേധിച്ചു
pa: ਅਨੁਮਤੀ ਅਸਵੀਕਾਰ ਕੀਤੀ ਗਈ
ta: அனுமதி மறுக்கப்பட்டது
te: అనుమతి నిరాకరించబడింది

# errorMicrophoneNotAvailable
source: Microphone not available
bn: মাইক্রোফোন উপলব্ধ নয়
kn: ಮೈಕ್ರೋಫೋನ್ ಲಭ್ಯವಿಲ್ಲ
ml: മൈക്രോഫോൺ ലഭ്യമല്ല
pa: ਮਾਈਕ੍ਰੋਫ਼ੋਨ ਉਪਲਬਧ ਨਹੀਂ ਹੈ
ta: மைக்ரோஃபோன் கிடைக்கவில்லை
te: మైక్రోఫోన్ అందుబాటులో లేదు

# errorSpeechRecognitionNotAvailable
source: Speech recognition not available
bn: স্পিচ রেকগনিশন উপলব্ধ নয়
kn: ಮಾತು ಗುರುತಿಸುವಿಕೆ ಲಭ್ಯವಿಲ್ಲ
ml: സ്പീച്ച് റെക്കഗ്നിഷൻ ലഭ്യമല്ല
pa: ਬੋਲੀ ਪਛਾਣ ਉਪਲਬਧ ਨਹੀਂ ਹੈ
ta: பேச்சு அங்கீகாரம் கிடைக்கவில்லை
te: మాటల గుర్తింపు అందుబాటులో లేదు

# errorInvalidCredentials
source: Invalid credentials
bn: অবৈধ শংসাপত্র
kn: ಅಮಾನ್ಯ ರುಜುವಾತುಗಳು
ml: അസാധുവായ ക്രെഡൻഷ്യലുകൾ
pa: ਅਵੈਧ ਪ੍ਰਮਾਣ ਪੱਤਰ
ta: தவறான சான்றுகள்
te: చెల్లని ఆధారాలు

# errorUnknownError
source: An unknown error occurred
bn: একটি অজানা ত্রুটি ঘটেছে
kn: ಒಂದು ಅಜ್ಞಾತ ದೋಷ ಸಂಭವಿಸಿದೆ
ml: അജ്ഞാതമായ പിശക് സംഭവിച്ചു
pa: ਇੱਕ ਅਗਿਆਤ ਗਲਤੀ ਹੋਈ ਹੈ
ta: ஒரு அறியப்படாத பிழை ஏற்பட்டது
te: ఒక అజ్ఞాత లోపం సంభవించింది

source: Communication Preference
bn: যোগাযোগ পছন্দ
kn: ಸಂವಹನ ಆದ್ಯತೆ
ml: ആശയവിനിമയ മുൻഗണന
pa: ਸੰਚਾਰ ਤਰਜੀਹ
ta: தொடர்பு விருப்பம்
te: సంచార ప్రాధాన్యత

source: Cancel
bn: বাতিল করুন
kn: ರದ್ದುಗೊಳಿಸಿ
ml: റദ്ദാക്കുക
pa: ਰੱਦ ਕਰੋ
ta: ரத்து செய்
te: రద్దు చేయండి

source: Your Smart Farming Assistant
bn: আপনার স্মার্ট কৃষি সহায়ক
kn: ನಿಮ್ಮ ಸ್ಮಾರ್ಟ್ ವ್ಯವಸಾಯ ಸಹಾಯಕ
ml: നിങ്ങളുടെ സ്മാർട്ട് കാർഷിക സഹായി
pa: ਤੁਹਾਡਾ ਸਮਾਰਟ ਖੇਤੀ ਸਹਾਇਕ
ta: உங்கள் ஸ்மார்ட் விவசாய உதவியாளர்
te: మీ స్మార్ట్ వ్యవసాయ సహాయకుడు

source: Main Features
bn: প্রধান বৈশিষ্ট্য
kn: ಮುಖ್ಯ ಲಕ್ಷಣಗಳು
ml: പ്രധാന സവിശേഷതകൾ
pa: ਮੁੱਖ ਵਿਸ਼ੇਸ਼ਤਾਵਾਂ
ta: முக்கிய அம்சங்கள்
te: ముఖ్య లక్షణాలు

source: Quick Actions
bn: দ্রুত ক্রিয়া
kn: ತ್ವರಿತ ಕ್ರಿಯೆಗಳು
ml: ദ്രുത പ്രവർത്തനങ്ങൾ
pa: ਤੇਜ਼ ਕਾਰਵਾਈਆਂ
ta: விரைவு செயல்கள்
te: వేగవంతమైన చర్యలు

source: Voice Assistant
bn: ভয়েস সহায়ক
kn: ಧ್ವನಿ ಸಹಾಯಕ
ml: വോയ്സ് അസിസ്റ്റന്റ്
pa: ਆਵਾਜ਼ ਅਸਿਸਟੈਂਟ
ta: குரல் உதவியாளர்
te: వాయిస్ అసిస్టెంట్

source: Chat Support
bn: চ্যাট সহায়তা
kn: ಚಾಟ್ ಬೆಂಬಲ
ml: ചാറ്റ് സപ്പോർട്ട്
pa: ਚੈਟ ਸਹਾਇਤਾ
ta: அரட்டை ஆதரவு
te: చాట్ మద్దతు

source: Crop Recommendation
bn: ফসল সুপারিশ
kn: ಬೆಳೆ ಸಲಹೆ
ml: ഫസൽ ശുപാർശ
pa: ਫਸਲ ਸਿਫਾਰਸ਼
ta: பயிர் பரிந்துரை
te: పంట సిఫార్సు

source: Yield Prediction
bn: ফলন পূর্বাভাস
kn: ಇಳುವರಿ ಮುನ್ಸೂಚನೆ
ml: ഉത്പാദന മുൻകൂട്ടി കാണൽ
pa: ਪੈਦਾਵਾਰ ਦੀ ਭਵਿੱਖਬਾਣੀ
ta: மகசூல் முன்னறிவிப்பு
te: దిగుబడి అంచనా

source: Disease Detection
bn: রোগ সনাক্তকরণ
kn: ರೋಗ ಕಂಡುಹಿಡಿಯುವಿಕೆ
ml: രോഗ കണ്ടെത്തൽ
pa: ਬਿਮਾਰੀ ਦੀ ਪਛਾਣ
ta: நோய் கண்டறிதல்
te: వ్యాధి గుర్తింపు

source: More Tools
bn: আরও সরঞ্জাম
kn: ಇನ್ನಷ್ಟು ಸಾಧನಗಳು
ml: കൂടുതൽ ഉപകരണങ്ങൾ
pa: ਹੋਰ ਸਾਧਨ
ta: மேலும் கருவிகள்
te: మరిన్ని పరికరాలు

source: AI Assistant
bn: এআই সহায়ক
kn: AI ಸಹಾಯಕ
ml: AI സഹായി
pa: AI ਸਹਾਇਕ
ta: AI உதவியாளர்
te: AI సహాయకుడు

source: Crop Analysis
bn: ফসল বিশ্লেষণ
kn: ಬೆಳೆ ವಿಶ್ಲೇಷಣೆ
ml: വിള വിശകലനം
pa: ਫਸਲ ਵਿਸ਼ਲੇਸ਼ਣ
ta: பயிர் பகுப்பாய்வு
te: పంట విశ్లేషణ

source: Plant Health
bn: গাছের স্বাস্থ্য
kn: ಸಸ್ಯ ಆರೋಗ್ಯ
ml: ചെടിയുടെ ആരോഗ്യം
pa: ਪੌਧੇ ਦੀ ਸਿਹਤ
ta: தாவர ஆரோக்கியம்
te: మొక్క ఆరోగ్యం

# soilAndFertilizer
source: Soil & Fertilizer
bn: মাটি ও সার
kn: ಮಣ್ಣು ಮತ್ತು ರಸಗೊಬ್ಬರ
ml: മണ്ണും വളവും
pa: ਮਿੱਟੀ ਅਤੇ ਖਾਦ
ta: மண் மற்றும் உரம்
te: మట్టి మరియు ఎరువులు

source: Tool Categories
bn: সরঞ্জামের শ্রেণী
kn: ಸಾಧನ ವರ್ಗಗಳು
ml: ഉപകരണ വിഭാഗങ്ങൾ
pa: ਸਾਧਨ ਸ਼੍ਰੇਣੀਆਂ
ta: கருவி வகைகள்
te: పరికర వర్గాలు

source: Take Photo
bn: ছবি তুলুন
kn: ಫೋಟೋ ತೆಗೆಯಿರಿ
ml: ഫോട്ടോ എടുക്കുക
pa: ਫ਼ੋਟੋ ਲਓ
ta: புகைப்படம் எடு
te: ఫోటో తీయండి

source: Upload Image
bn: ছবি আপলোড করুন
kn: ಚಿತ್ರವನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಿ
ml: ചിത്രം അപ്‌ലോഡ് ചെയ്യുക
pa: ਚਿੱਤਰ ਅਪਲੋਡ ਕਰੋ
ta: படத்தை பதிவேற்று
te: చిత్రాన్ని అప్‌లోడ్ చేయండి

source: Voice Query
bn: ভয়েস প্রশ্ন
kn: ಧ್ವನಿ ಪ್ರಶ್ನೆ
ml: വോയ്സ് ചോദ്യം
pa: ਆਵਾਜ਼ ਸਵਾਲ
ta: குரல் கேள்வி
te: వాయిస్ ప్రశ్న
