Repository: TanvishGG/Krishi-Sakhi
Catalog: Flutter App/lib/l10n/app_*.arb
Languages: bn, kn, ml, pa, ta, te

# pestDetectionDesc
source: Upload crop images to detect pests using AI vision.
bn: AI দৃষ্টি ব্যবহার করে কীটপতঙ্গ শনাক্ত করতে ফসলের ছবি আপলোড করুন।
kn: AI ದೃಷ್ಟಿ ಬಳಸಿಕೊಂಡು ಕೀಟಗಳನ್ನು ಕಂಡುಹಿಡಿಯಲು ಬೆಳೆ ಚಿತ್ರಗಳನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಿ.
ml: AI ദർശനം ഉപയോഗിച്ച് കീടങ്ങൾ കണ്ടെത്താൻ ഫസൽ ചിത്രങ്ങൾ അപ്‌ലോഡ് ചെയ്യുക.
pa: AI ਦ੍ਰਿਸ਼ਟੀ ਦੀ ਵਰਤੋਂ ਕਰਕੇ ਕੀੜੇ-ਮਕੌੜਿਆਂ ਦਾ ਪਤਾ ਲਗਾਉਣ ਲਈ ਫਸਲ ਦੀਆਂ ਤਸਵੀਰਾਂ ਅਪਲੋਡ ਕਰੋ।
ta: AI பார்வையைப் பயன்படுத்தி பூச்சிகளைக் கண்டறிய பயிர் படங்களைப் பதிவேற்றவும்.
te: AI దృష్టిని ఉపయోగించి కీటకాలను గుర్తించడానికి పంట చిత్రాలను అప్‌లోడ్ చేయండి.

# fertilizerRecommendationDesc
source: Get AI recommendations for the best fertilizers based on soil type, crop, and environmental conditions.
bn: সর্বোত্তম ফসল বৃদ্ধির জন্য ব্যক্তিগত সারের সুপারিশ পান।
kn: ಅನುಕೂಲ ಬೆಳೆ ಬೆಳವಣಿಗೆ ವೈಯಕ್ತಿಕ ರಸಗೊಬ್ಬರ ಶಿಫಾರಸುಗಳನ್ನು ಪಡೆಯಿರಿ.
ml: ഉത്തമമായ ഫസൽ വളർച്ചയ്ക്കായി വ്യക്തിഗതമാക്കിയ ഫെർട്ടിലൈസർ ശുപാർശകൾ നേടുക.
pa: ਵਧੀਆ ਫਸਲ ਵਿਕਾਸ ਲਈ ਨਿੱਜੀ ਖਾਦ ਸਿਫਾਰਸ਼ਾਂ ਪ੍ਰਾਪਤ ਕਰੋ।
ta: உகந்த பயிர் வளர்ச்சிக்கு தனிப்பட்ட உர பரிந்துரைகளைப் பெறுங்கள்.
te: అనుకూలమైన పంట వృద్ధి కోసం వ్యక్తిగత ఎరువు సిఫార్సులను పొందండి.

source: Login successful!
bn: লগইন সফল!
kn: ಲಾಗಿನ್ ಯಶಸ್ವಿ!
ml: ലോഗിൻ വിജയകരം!
pa: ਲੌਗਇਨ ਸਫਲ!
ta: உள்நுழைவு வெற்றிகரமாக!
te: లాగిన్ విజయవంతం!

# loginFailed
source: Login failed. Please try again.
bn: লগইন ব্যর্থ। অনুগ্রহ করে আবার চেষ্টা করুন।
kn: ಲಾಗಿನ್ ವಿಫಲ. ದಯವಿಟ್ಟು ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ.
ml: ലോഗിൻ പരാജയപ്പെട്ടു. ദയവായി വീണ്ടും ശ്രമിക്കുക.
pa: ਲੌਗਇਨ ਅਸਫਲ। ਕਿਰਪਾ ਕਰਕੇ ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
ta: உள்நுழைவு தோல்வியடைந்தது. மீண்டும் முயற்சி செய்யவும்.
te: లాగిన్ విఫలమైంది. మళ్లీ ప్రయత్నించండి.

# termsAndPrivacy
source: By continuing, you agree to our terms and privacy policy
bn: চালিয়ে যাওয়ার মাধ্যমে, আপনি আমাদের শর্তাবলী এবং গোপনীয়তা নীতিতে সম্মত হন
kn: ಮುಂದುವರಿಸುವ ಮೂಲಕ, ನೀವು ನಮ್ಮ ನಿಯಮಗಳು ಮತ್ತು ಗೌಪ್ಯತೆ ನೀತಿಗೆ ಒಪ್ಪುತ್ತೀರಿ
ml: തുടരുന്നതിലൂടെ, നിങ്ങൾ ഞങ്ങളുടെ നിബന്ധനകളും സ്വകാര്യതാ നയവും അംഗീകരിക്കുന്നു
pa: ਜਾਰੀ ਰੱਖਣ ਨਾਲ, ਤੁਸੀਂ ਸਾਡੀਆਂ ਸ਼ਰਤਾਂ ਅਤੇ ਪ੍ਰਾਈਵੇਸੀ ਪਾਲਿਸੀ ਨਾਲ ਸਹਿਮਤ ਹੋ।
ta: தொடர்வதன் மூலம், நீங்கள் எங்கள் சொற்களையும் தனியுரிமைக் கொள்கையையும் ஒப்புக்கொள்கிறீர்கள்
te: కొనసాగించడం ద్వారా, మీరు మా నిబంధనలు మరియు ప్రైవసీ పాలసీని అంగీకరిస్తున్నారు

# pleaseFillField
source: Please fill this field.
bn: অনুগ্রহ করে এই ক্ষেত্রটি পূরণ করুন।
kn: ದಯವಿಟ್ಟು ಈ ಕ್ಷೇತ್ರವನ್ನು ತುಂಬಿಸಿ.
ml: ദയവായി ഈ ഫീൽഡ് പൂരിപ്പിക്കുക.
pa: ਕਿਰਪਾ ਕਰਕੇ ਇਸ ਫੀਲਡ ਨੂੰ ਭਰੋ।
ta: இந்தப் புலத்தை நிரப்பவும்.
te: దయచేసి ఈ ఫీల్డ్ నింపండి.

source: Setup complete!
bn: সেটআপ সম্পন্ন!
kn: ಸೆಟಪ್ ಪೂರ್ಣ!
ml: സെറ്റപ്പ് പൂർത്തിയായി!
pa: ਸੈੱਟਅੱਪ ਪੂਰਾ!
ta: அமைப்பு முடிந்தது!
te: సెటప్ పూర్తైంది!

source: Environmental Factors
bn: পরিবেশগত কারণ
kn: ಪರಿಸರ ಅಂತರಾಯಗಳು
ml: പരിസ്ഥിതി ഘടകങ്ങൾ
pa: ਪਰਿਸਰੀ ਕਾਰਕ
ta: சுற்றுச்சூழல் காரணிகள்
te: పర్యావరణ కారకాలు

source: Key Benefits
bn: প্রধান সুবিধা
kn: ಪ್ರಮುಖ ಲಾಭಗಳು
ml: പ്രധാന നേട്ടങ്ങൾ
pa: ਮੁੱਖ ਲਾਭ
ta: முக்கிய நன்மைகள்
te: ప్రధాన ప్రయోజనాలు

source: Risk Considerations
bn: ঝুঁকি বিবেচনা
kn: ಅಪಾಯ ಪರಿಗಣನೆಗಳು
ml: അപകട പരിഗണനകൾ
pa: ਜੋਖਮ ਵਿਚਾਰ
ta: அபாய கருத்துகள்
te: రిస్క్ పరిగణనలు

source: Farming Recommendations
bn: কৃষি সুপারিশ
kn: ಕೃಷಿ ಶಿಫಾರಸುಗಳು
ml: കൃഷി ശുപാർശകൾ
pa: ਕਿਸਾਨੀ ਸਿਫਾਰਸ਼ਾਂ
ta: விவசாய பரிந்துரைகள்
te: వ్యవసాయ సిఫార్సులు

source: Generating AI Analysis...
bn: AI বিশ্লেষণ তৈরি করা হচ্ছে...
kn: AI ವಿಶ್ಲೇಷಣೆ ಉತ್ಪಾದಿಸುತ್ತಿದೆ
ml: AI വിശകലനം സൃഷ്ടിക്കുന്നു...
pa: AI ਵਿਸ਼ਲੇਸ਼ਣ ਤਿਆਰ ਕੀਤਾ ਜਾ ਰਿਹਾ ਹੈ...
ta: AI பகுப்பாய்வை உருவாக்குகிறது...
te: AI విశ్లేషణ ఉత్పత్తి చేస్తోంది

source: Crop Details
bn: ফসলের বিবরণ
kn: ಬೆಳೆ ವಿವರಗಳು
ml: ഫസൽ വിവരങ്ങൾ
pa: ਫਸਲ ਦੇ ਵੇਰਵੇ
ta: பயிர் விவரங்கள்
te: పంట వివరాలు

source: State
bn: রাজ্য
kn: ರಾಜ್ಯ
ml: സംസ്ഥാനം
pa: ਰਾਜ
ta: மாநிலம்
te: రాష్ట్రం

source: District
bn: জেলা
kn: ಜಿಲ್ಲೆ
ml: ജില്ല
pa: ਜ਼ਿਲ੍ਹਾ
ta: மாவட்டம்
te: జిల్లా

source: Season
bn: মৌসুম
kn: ಹಬ್ಬ
ml: കാലം
pa: ਮੌਸਮ
ta: பருவம்
te: కాలం

# areaAndYear
source: Area & Year
bn: এলাকা এবং বছর
kn: ಪ್ರದೇಶ ಮತ್ತು ವರ್ಷ
ml: വിസ്തീർണ്ണം & വർഷം
pa: ਖੇਤਰਫਲ ਅਤੇ ਸਾਲ
ta: பரப்பு மற்றும் ஆண்டு
te: విస్తీర్ణం & సంవత్సరం

source: Area (hectares)
bn: এলাকা (হেক্টর)
kn: ಪ್ರದೇಶ (ಹೆಕ್ಟೇರ್)
ml: വിസ്തീർണ്ണം (ഹെക്ടർ)
pa: ਖੇਤਰਫਲ (ਹੈਕਟੇਅਰ)
ta: பரப்பு (ஹெக்டேர்கள்)
te: విస్తీర్ణం (హెక్టార్లు)

source: Year
bn: বছর
kn: ವರ್ಷ
ml: വർഷം
pa: ਸਾਲ
ta: ஆண்டு
te: సంవత్సరం

source: Predict Yield
bn: উৎপাদনের পূর্বাভাস দিন
kn: ಉತ್ಪಾದನೆಯನ್ನು ಊಹಿಸಿ
ml: ഉത്പാദനം മുൻകൂട്ടി കാണുക
pa: ਉਪਜ ਦਾ ਅਨੁਮਾਨ ਲਗਾਓ
ta: உற்பத்தியை கணிக்கவும்
te: ఉత్పత్తిని అంచనా వేయండి

source: Predicted Yield
bn: পূর্বাভাসিত উৎপাদন
kn: ಊಹಿಸಿದ ಉತ್ಪಾದನೆ
ml: മുൻകൂട്ടി കണ്ട ഉത്പാദനം
pa: ਅਨੁਮਾਨਿਤ ਉਪਜ
ta: கணிக்கப்பட்ட உற்பத்தி
te: అంచనా వేసిన ఉత్పత్తి

# tonsPerHectare
source: tons/hectare
bn: টন/হেক্টর
kn: ಟನ್/ಹೆಕ್ಟೇರ್
ml: ടൺ/ഹെക്ടർ
pa: ਟਨ/ਹੈਕਟੇਅਰ
ta: டன்/ஹெக்டேர்
te: టన్నులు/హెక్టార్

# marketPriceAndProfitAnalysis
source: Market Price & Profit Analysis
bn: বাজার মূল্য এবং লাভ বিশ্লেষণ
kn: ಮಾರುಕಟ್ಟೆ ಬೆಲೆ ಮತ್ತು ಲಾಭ ವಿಶ್ಲೇಷಣೆ
ml: വിപണി വിലയും ലാഭ വിശകലനവും
pa: ਮਾਰਕੀਟ ਮੁੱਲ ਅਤੇ ਮੁਨਾਫ਼ਾ ਵਿਸ਼ਲੇਸ਼ਣ
ta: சந்தை விலை மற்றும் லாப பகுப்பாய்வு
te: మార్కెట్ ధర మరియు లాభ విశ్లేషణ

source: Current Market Price:
bn: বর্তমান বাজার মূল্য:
kn: ಪ್ರಸ್ತುತ ಮಾರುಕಟ್ಟೆ ಬೆಲೆ:
ml: നിലവിലെ വിപണി വില:
pa: ਮੌਜੂਦਾ ਮਾਰਕੀਟ ਮੁੱਲ:
ta: தற்போதைய சந்தை விலை:
te: ప్రస్తుత మార్కెట్ ధర:

source: per kg
bn: প্রতি কেজি
kn: ಪ್ರತಿ ಕೆಜಿ
ml: കിലോയ്ക്ക്
pa: ਪ੍ਰਤੀ ਕਿਲੋ
ta: ஒரு கிலோக்கு
te: కిలోకు

source: Price Range:
bn: মূল্য পরিসীমা:
kn: ಬೆಲೆ ಶ್ರೇಣಿ:
ml: വില പരിധി:
pa: ਮੁੱਲ ਸੀਮਾ:
ta: விலை வரம்பு:
te: ధర పరిధి:

source: Profit Analysis:
bn: লাভ বিশ্লেষণ:
kn: ಲಾಭ ವಿಶ್ಲೇಷಣೆ:
ml: ലാഭ വിശകലനം:
pa: ਮੁਨਾਫ਼ਾ ਵਿਸ਼ਲੇਸ਼ਣ:
ta: லாப பகுப்பாய்வு:
te: లాభ విశ్లేషణ:

source: Total Revenue:
bn: মোট আয়:
kn: ಒಟ್ಟು ಆದಾಯ:
ml: ആകെ വരുമാനം:
pa: ਕੁਲ ਆਮਦਨੀ:
ta: மொத்த வருவாய்:
te: మొత్తం ఆదాయం:

source: Estimated Costs:
bn: আনুমানিক খরচ:
kn: ಅಂದಾಜು ಖರ್ಚುಗಳು:
ml: കണക്കാക്കിയ ചിലവുകൾ:
pa: ਅਨੁਮਾਨਿਤ ਲਾਗਤ:
ta: கணிக்கப்பட்ட செலவுகள்:
te: అంచనా వేసిన ఖర్చులు:

source: Net Profit:
bn: নেট লাভ:
kn: ನಿವ್ವಳ ಲಾಭ:
ml: നിക്ഷേപ ലാഭം:
pa: ਨਿੱਟ ਮੁਨਾਫ਼ਾ:
ta: நிகர லாபம்:
te: నికర లాభం:

source: Profit per Hectare:
bn: প্রতি হেক্টর লাভ:
kn: ಪ್ರತಿ ಹೆಕ್ಟೇರ್ ಲಾಭ:
ml: ഹെക്ടറിന് ലാഭം:
pa: ਪ੍ਰਤੀ ਹੈਕਟੇਅਰ ਮੁਨਾਫ਼ਾ:
ta: ஒரு ஹெக்டேருக்கு லாபம்:
te: హెక్టార్‌కు లాభం:

source: Market Trends
bn: বাজার প্রবণতা
kn: ಮಾರುಕಟ್ಟೆ ಪ್ರವೃತ್ತಿಗಳು
ml: വിപണി പ്രവണതകൾ
pa: ਮਾਰਕੀਟ ਰੁਝਾਨ
ta: சந்தை போக்குகள்
te: మార్కెట్ ట్రెండ్‌లు

source: Selling Strategies
bn: বিক্রয় কৌশল
kn: ಮಾರಾಟ ತಂತ್ರಗಳು
ml: വിൽപ്പന തന്ത്രങ്ങൾ
pa: ਵਿਕਰੀ ਰਣਨੀਤੀਆਂ
ta: விற்பனை உத்திகள்
te: అమ్మకపు వ్యూహాలు

source: Risk Factors
bn: ঝুঁকি কারণ
kn: ಅಪಾಯ ಅಂತರಾಯಗಳು
ml: അപകട ഘടകങ്ങൾ
pa: ਜੋਖਮ ਕਾਰਕ
ta: அபாய காரணிகள்
te: రిస్క్ కారకాలు

source: Government Support
bn: সরকারী সহায়তা
kn: ಸರ್ಕಾರಿ ಬೆಂಬಲ
ml: സർക്കാർ പിന്തുണ
pa: ਸਰਕਾਰੀ ਸਹਾਇਤਾ
ta: அரசு உதவி
te: ప్రభుత్వ మద్దతు

source: Invalid year
bn: অবৈধ বছর
kn: ಅಮಾನ್ಯ ವರ್ಷ
ml: അസാധുവായ വർഷം
pa: ਗਲਤ ਸਾਲ
ta: தவறான ஆண்டு
te: చెల్లని సంవత్సరం

source: Analyze Disease
bn: রোগ বিশ্লেষণ করুন
kn: ರೋಗವನ್ನು ವಿಶ್ಲೇಷಿಸಿ
ml: രോഗം വിശകലനം ചെയ്യുക
pa: ਬਿਮਾਰੀ ਦਾ ਵਿਸ਼ਲੇਸ਼ਣ ਕਰੋ
ta: நோயை பகுப்பாய்வு செய்
te: వ్యాధిని విశ్లేషించు

source: Analyze Pest
bn: পোকা বিশ্লেষণ করুন
kn: ಕೀಟವನ್ನು ವಿಶ್ಲೇಷಿಸಿ
ml: കീടങ്ങളെ വിശകലനം ചെയ്യുക
pa: ਕੀਟ ਦਾ ਵਿਸ਼ਲੇਸ਼ਣ ਕਰੋ
ta: பூச்சியை பகுப்பாய்வு செய்
te: కీటకాన్ని విశ్లేషించండి

source: Detection Results
bn: সনাক্তকরণ ফলাফল
kn: ಪತ್ತೆ ಫಲಿತಾಂಶಗಳು
ml: കണ്ടെത്തൽ ഫലങ്ങൾ
pa: ਪਛਾਣ ਨਤੀਜੇ
ta: கண்டறிதல் முடிவுகள்
te: గుర్తింపు ఫలితాలు

# diseaseLabel
source: Disease:
bn: রোগ:
kn: ರೋಗ:
ml: രോഗം:
pa: ਬਿਮਾਰੀ:
ta: நோய்:
te: వ్యాధి:

# pestLabel
source: Pest:
bn: পোকা:
kn: ಕೀಟ:
ml: കീടം:
pa: ਕੀਟ:
ta: பூச்சி:
te: కీటకం:

# confidenceLabel
source: Confidence:
bn: আত্মবিশ্বাস:
kn: ವಿಶ್ವಾಸ:
ml: വിശ്വാസം:
pa: ਭਰੋਸਾ:
ta: நம்பிக்கை:
te: విశ్వాసం:

source: Clear Image
bn: ছবি সাফ করুন
kn: ಚಿತ್ರವನ್ನು ತೆರವುಗೊಳಿಸಿ
ml: ചിത്രം മായ്ക്കുക
pa: ਤਸਵੀਰ ਸਾਫ਼ ਕਰੋ
ta: படத்தை அழி
te: చిత్రాన్ని తీసివేయు

# diseaseDetectionInstructions
source: Take a clear photo of the plant leaf showing any symptoms or discoloration. The AI will analyze the image to detect potential diseases.
bn: উদ্ভিদের পাতার একটি স্পষ্ট ছবি তুলুন যাতে কোনও লক্ষণ বা রঙ পরিবর্তন দেখা যায়। সম্ভাব্য রোগগুলি সনাক্ত করতে AI ছবিটি বিশ্লেষণ করবে।
kn: ರೋಗ ಲಕ್ಷಣಗಳು ಅಥವಾ ಬಣ್ಣ ಬದಲಾವಣೆಯನ್ನು ತೋರಿಸುವ ಸಸ್ಯದ ಎಲೆಯ ಸ್ಪಷ್ಟ ಫೋಟೋ ತೆಗೆಯಿರಿ. ಸಂಭಾವ್ಯ ರೋಗಗಳನ್ನು ಪತ್ತೆ ಮಾಡಲು AI ಚಿತ್ರವನ್ನು ವಿಶ್ಲೇಷಿಸುತ್ತದೆ.
ml: രോഗലക്ഷണങ്ങൾ അല്ലെങ്കിൽ നിറം മാറ്റം കാണിക്കുന്ന ചെടിയുടെ ഇലയുടെ വ്യക്തമായ ഫോട്ടോ എടുക്കുക. സാധ്യമായ രോഗങ്ങൾ കണ്ടെത്താൻ AI ചിത്രം വിശകലനം ചെയ്യും.
pa: ਪੌਦੇ ਦੇ ਪੱਤੇ ਦੀ ਇੱਕ ਸਪਸ਼ਟ ਤਸਵੀਰ ਲਓ ਜਿਸ ਵਿੱਚ ਕੋਈ ਲੱਛਣ ਜਾਂ ਰੰਗ ਬਦਲਾਅ ਦਿਖਾਈ ਦੇ। ਸੰਭਾਵਿਤ ਬਿਮਾਰੀਆਂ ਦਾ ਪਤਾ ਲਗਾਉਣ ਲਈ AI ਤਸਵੀਰ ਦਾ ਵਿਸ਼ਲੇਸ਼ਣ ਕਰੇਗਾ।
ta: நோய் அறிகுறிகள் அல்லது நிற மாற்றத்தைக் காட்சி செய்யும் தாவர இலையின் தெளிவான புகைப்படத்தை எடுக்கவும். சாத்தியமான நோய்களைக் கண்டறிய AI படத்தை பகுப்பாய்வு செய்யும்.
te: వ్యాధి లక్షణాలు లేదా రంగు మార్పు చూపించే మొక్క ఆకు యొక్క స్పష్టమైన ఫోటో తీయండి. సంభావ్య వ్యాధులను గుర్తించడానికి AI చిత్రాన్ని విశ్లేషిస్తుంది.

# pestDetectionInstructions
source: Take a clear photo of the crop showing any pest damage or insects. The AI will analyze the image to detect potential pests.
bn: ফসলে কোনও পোকার ক্ষতি বা পোকামাকড় দেখিয়ে একটি স্পষ্ট ছবি তুলুন। সম্ভাব্য পোকা শনাক্ত করতে AI ছবিটি বিশ্লেষণ করবে।
kn: ಯಾವುದೇ ಕೀಟ ಹಾನಿ ಅಥವಾ ಕೀಟಗಳನ್ನು ತೋರಿಸುವ ಬೆಳೆಯ ಸ್ಪಷ್ಟ ಫೋಟೋ ತೆಗೆಯಿರಿ. ಸಂಭಾವ್ಯ ಕೀಟಗಳನ್ನು ಪತ್ತೆ ಮಾಡಲು AI ಚಿತ್ರವನ್ನು ವಿಶ್ಲೇಷಿಸುತ್ತದೆ.
ml: കീട നാശത്തിന്റെയോ പ്രാണികളുടെയോ വ്യക്തമായ ഫോട്ടോ എടുക്കുക. സംഭാവ്യമായ കീടങ്ങളെ കണ്ടെത്താൻ AI ചിത്രം വിശകലനം ചെയ്യും.
pa: ਕਿਸੇ ਵੀ ਕੀਟ ਨੁਕਸਾਨ ਜਾਂ ਕੀੜਿਆਂ ਨੂੰ ਦਿਖਾਉਂਦੀ ਫਸਲ ਦੀ ਸਪਸ਼ਟ ਫੋਟੋ ਲਓ। ਸੰਭਾਵੀ ਕੀਟਾਂ ਦਾ ਪਤਾ ਲਗਾਉਣ ਲਈ AI ਚਿੱਤਰ ਦਾ ਵਿਸ਼ਲੇਸ਼ਣ ਕਰੇਗਾ।
ta: எந்தவொரு பூச்சி சேதம் அல்லது பூச்சிகளையும் காட்சியாகக் கொண்ட பயிரின் தெளிவான புகைப்படத்தை எடுக்கவும். சாத்தியமான பூச்சிகளைக் கண்டறிய AI படத்தை பகுப்பாய்வு செய்யும்.
te: ఏవైనా కీటక నష్టం లేదా కీటకాలను చూపించే పంట యొక్క స్పష్టమైన ఫోటో తీయండి. సంభావ్య కీటకాలను గుర్తించడానికి AI చిత్రాన్ని విశ్లేషిస్తుంది.

# soilAndCropInformation
source: Soil & Crop Information
bn: মাটি এবং ফসলের তথ্য
kn: ಮಣ್ಣು ಮತ್ತು ಬೆಳೆ ಮಾಹಿತಿ
ml: മണ്ണും ഫസലും വിവരങ്ങൾ
pa: ਮਿੱਟੀ ਅਤੇ ਫਸਲ ਦੀ ਜਾਣਕਾਰੀ
ta: மண் மற்றும் பயிர் தகவல்
te: మట్టి మరియు పంట సమాచారం

# soilHealthCardInfo
source: Refer to your soil health card or apply for one at https://soilhealth.dac.gov.in/soilhealthcard
bn: আপনার মাটি স্বাস্থ্য কার্ড দেখুন বা https://soilhealth.dac.gov.in/soilhealthcard এ আবেদন করুন
kn: ನಿಮ್ಮ ಮಣ್ಣಿನ ಆರೋಗ್ಯ ಕಾರ್ಡ್ ನೋಡಿ ಅಥವಾ https://soilhealth.dac.gov.in/soilhealthcard ನಲ್ಲಿ ಅರ್ಜಿ ಸಲ್ಲಿಸಿ
ml: നിങ്ങളുടെ മണ്ണ് ആരോഗ്യ കാർഡ് പരിശോധിക്കുക അല്ലെങ്കിൽ https://soilhealth.dac.gov.in/soilhealthcard എന്ന വെബ്‌സൈറ്റിൽ അപേക്ഷിക്കുക
pa: ਆਪਣੀ ਮਿੱਟੀ ਸਿਹਤ ਕਾਰਡ ਦੇਖੋ ਜਾਂ https://soilhealth.dac.gov.in/soilhealthcard ਤੇ ਅਰਜ਼ੀ ਦਿਓ
ta: உங்கள் மண் ஆரோக்கிய அட்டையைப் பார்க்கவும் அல்லது https://soilhealth.dac.gov.in/soilhealthcard இல் விண்ணப்பிக்கவும்
te: మీ మట్టి ఆరోగ్య కార్డ్‌ను చూడండి లేదా https://soilhealth.dac.gov.in/soilhealthcard వద్ద దరఖాస్తు చేయండి

source: Crop Type
bn: ফসলের ধরন
kn: ಬೆಳೆಯ ಪ್ರಕಾರ
ml: ഫസൽ തരം
pa: ਫਸਲ ਦੀ ਕਿਸਮ
ta: பயிர் வகை
te: పంట రకం

source: Moisture (%)
bn: আর্দ্রতা (%)
kn: ತೇವಾಂಶ (%)
ml: ഈർപ്പം (%)
pa: ਨਮੀ (%)
ta: ஈரப்பதம் (%)
te: తేమ (%)

source: Soil Nutrient Levels
bn: মাটির পুষ্টি স্তর
kn: ಮಣ್ಣಿನ ಪೋಷಕ ಮಟ್ಟಗಳು
ml: മണ്ണ് പോഷക നിലകൾ
pa: ਮਿੱਟੀ ਪੋਸ਼ਣ ਪੱਧਰ
ta: மண் ஊட்டச்சத்து நிலைகள்
te: మట్టి పోషక స్థాయిలు

source: Phosphorous
bn: ফসফরাস
kn: ಫಾಸ್ಫರಸ್
ml: ഫോസ്ഫറസ്
pa: ਫਾਸਫੋਰਸ
ta: பாஸ்பரஸ்
te: ఫాస్ఫరస్

source: Recommended Fertilizer
bn: প্রস্তাবিত সার
kn: ಶಿಫಾರಸು ಮಾಡಿದ ಗೊಬ್ಬರ
ml: ശുപാർശ ചെയ്ത ഫെർട്ടിലൈസർ
pa: ਸਿਫਾਰਿਸ਼ ਕੀਤਾ ਖਾਦ
ta: பரிந்துரைக்கப்பட்ட உரம்
te: సిఫార్సు చేసిన ఎరువు

source: Please select soil type
bn: দয়া করে মাটির ধরন নির্বাচন করুন
kn: ದಯವಿಟ್ಟು ಮಣ್ಣಿನ ಪ್ರಕಾರವನ್ನು ಆಯ್ಕೆ ಮಾಡಿ
ml: ദയവായി മണ്ണിന്റെ തരം തിരഞ്ഞെടുക്കുക
pa: ਕਿਰਪਾ ਕਰਕੇ ਮਿੱਟੀ ਦੀ ਕਿਸਮ ਚੁਣੋ
ta: தயவுசெய்து மண்ணின் வகையைத் தேர்ந்தெடுக்கவும்
te: దయచేసి మట్టి రకాన్ని ఎంచుకోండి

source: Please select crop type
bn: দয়া করে ফসলের ধরন নির্বাচন করুন
kn: ದಯವಿಟ್ಟು ಬೆಳೆಯ ಪ್ರಕಾರವನ್ನು ಆಯ್ಕೆ ಮಾಡಿ
ml: ദയവായി വിളയുടെ തരം തിരഞ്ഞെടുക്കുക
pa: ਕਿਰਪਾ ਕਰਕੇ ਫਸਲ ਦੀ ਕਿਸਮ ਚੁਣੋ
ta: தயவுசெய்து பயிர் வகையைத் தேர்ந்தெடுக்கவும்
te: దయచేసి పంట రకాన్ని ఎంచుకోండి

# weatherDataRequiredFertilizer
source: Weather data is required for fertilizer recommendation. Please ensure location permission is granted.
bn: সার সুপারিশের জন্য আবহাওয়া ডেটা প্রয়োজন। দয়া করে অবস্থান অনুমতি নিশ্চিত করুন.
kn: ಗೊಬ್ಬರ ಶಿಫಾರಸಿಗಾಗಿ ಹವಾಮಾನ ಡೇಟಾ ಅಗತ್ಯವಿದೆ. ದಯವಿಟ್ಟು ಸ್ಥಳ ಅನುಮತಿಯನ್ನು ಖಚಿತಪಡಿಸಿ.
ml: എരുവ ശുപാർശയ്ക്ക് കാലാവസ്ഥ ഡാറ്റ ആവശ്യമാണ്. ദയവായി ലൊക്കേഷൻ അനുമതി ഉറപ്പാക്കുക.
pa: ਖਾਦ ਸਿਫਾਰਿਸ਼ ਲਈ ਮੌਸਮ ਡੇਟਾ ਲੋੜੀਂਦਾ ਹੈ। ਕਿਰਪਾ ਕਰਕੇ ਟਿਕਾਣਾ ਇਜਾਜ਼ਤ ਨੂੰ ਯਕੀਨੀ ਬਣਾਓ.
ta: உர சிபாரிசுக்கு வானிலை தரவு தேவை. தயவுசெய்து இட அனுமதியை உறுதிப்படுத்தவும்.
te: ఎరువ సిఫార్సు కోసం వాతావరణ డేటా అవసరం. దయచేసి స్థాన అనుమతిని నిర్ధారించండి.

source: Financial Assistance
bn: আর্থিক সহায়তা
kn: ಹಣಕಾಸು ಸಹಾಯ
ml: ധനസഹായം
pa: ਵਿੱਤੀ ਮਦਦ
ta: நிதி உதவி
te: ఆర్థిక సహాయం

# governmentSchemesAndLoans
source: Government Schemes & Loans
bn: সরকারি প্রকল্প এবং ঋণ
kn: ಸರ್ಕಾರಿ ಯೋಜನೆಗಳು ಮತ್ತು ಸಾಲಗಳು
ml: സർക്കാർ പദ്ധതികളും വായ്പകളും
pa: ਸਰਕਾਰੀ ਸਕੀਮਾਂ ਅਤੇ ਕਰਜ਼ੇ
ta: அரசு திட்டங்கள் மற்றும் கடன்கள்
te: ప్రభుత్వ పథకాలు మరియు రుణాలు
