Repository: TanvishGG/Krishi-Sakhi
Catalog: Flutter App/lib/l10n/app_*.arb
Languages: bn, kn, ml, pa, ta, te

source: Weather data unavailable
bn: আবহাওয়া তথ্য অনুপলব্ধ
kn: ಹವಾಮಾನ ಡೇಟಾ ಲಭ್ಯವಿಲ್ಲ
ml: കാലാവസ്ഥാ വിവരങ്ങൾ ലഭ്യമല്ല
pa: ਮੌਸਮ ਡੇਟਾ ਉਪਲਬਧ ਨਹੀਂ
ta: வானிலை தரவு கிடைக்கவில்லை
te: వాతావరణ డేటా అందుబాటులో లేదు

source: Retry
bn: পুনরায় চেষ্টা করুন
kn: ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ
ml: വീണ്ടും ശ്രമിക്കുക
pa: ਮੁੜ ਕੋਸ਼ਿਸ਼ ਕਰੋ
ta: மீண்டும் முயற்சிக்கவும்
te: మళ్లీ ప్రయత్నించండి

source: Clear History
bn: ইতিহাস সাফ করুন
kn: ಇತಿಹಾಸವನ್ನು ತೆರವುಗೊಳಿಸಿ
ml: ഹിസ്റ്ററി മായ്ക്കുക
pa: ਇਤਿਹਾਸ ਸਾਫ਼ ਕਰੋ
ta: வரலாற்றை அழிக்கவும்
te: చరిత్రను తొలగించండి

# areYouSureClearHistory
source: Are you sure you want to clear all conversation history?
bn: আপনি কি সমস্ত কথোপকথনের ইতিহাস মুছে ফেলতে চান?
kn: ನೀವು ಎಲ್ಲಾ ಸಂಭಾಷಣೆ ಇತಿಹಾಸವನ್ನು ತೆರವುಗೊಳಿಸಲು ಬಯಸುವಿರಾ?
ml: എല്ലാ സംഭാഷണ ഹിസ്റ്ററിയും മായ്ക്കണമെന്ന് തീർച്ചയാണോ?
pa: ਕੀ ਤੁਸੀਂ ਸਾਰੇ ਗੱਲਬਾਤ ਦਾ ਇਤਿਹਾਸ ਸਾਫ਼ ਕਰਨਾ ਚਾਹੁੰਦੇ ਹੋ?
ta: நீங்கள் அனைத்து உரையாடல் வரலாற்றையும் அழிக்க விரும்புகிறீர்களா?
te: మీరు అన్ని సంభాషణ చరిత్రను క్లియర్ చేయాలని అనుకుంటున్నారా?

source: Clear
bn: সাফ করুন
kn: ತೆರವುಗೊಳಿಸಿ
ml: മായ്ക്കുക
pa: ਸਾਫ਼ ਕਰੋ
ta: அழி
te: తొలగించు

source: Fertilizer
bn: সার
kn: ರಸಗೊಬ್ಬರ
ml: വളം
pa: ਖਾਦ
ta: உரம்
te: ఎరువులు

source: Fertilizer Recommendation
bn: সার সুপারিশ
kn: ರಸಗೊಬ್ಬರ ಶಿಫಾರಸು
ml: വള ശുപാർശ
pa: ਖਾਦ ਸਿਫਾਰਿਸ਼
ta: உர பரிந்துரை
te: ఎరువుల సిఫార్సు

source: Tools
bn: সরঞ্জাম
kn: ಸಾಧನಗಳು
ml: ഉപകരണങ്ങൾ
pa: ਸਾਧਨ
ta: கருவிகள்
te: పరికరాలు

source: Crop Name
bn: ফসলের নাম
kn: ಬೆಳೆಯ ಹೆಸರು
ml: വിള പേര്
pa: ਫਸਲ ਦਾ ਨਾਮ
ta: பயிர் பெயர்
te: పంట పేరు

source: Soil Type
bn: মাটির ধরন
kn: ಮಣ್ಣಿನ ರಀತಿ
ml: മണ്ണിന്റെ തരം
pa: ਮਿੱਟੀ ਦੀ ਕਿਸਮ
ta: மண் வகை
te: మట్టి రకం

source: Nitrogen Content
bn: নাইট্রোজেন উপাদান
kn: ನೈಟ್ರೊಜನ್ ಅಂಶ
ml: നൈട്രജൻ അളവ്
pa: ਨਾਈਟਰੋਜਨ ਸਮੱਗਰੀ
ta: நைட்ரஜன் உள்ளடக்கம்
te: నైట్రోజన్ కంటెంట్

source: Phosphorous Content
bn: ফসফরাস উপাদান
kn: ಫಾಸ್ಫರಸ್ ಅಂಶ
ml: ഫോസ്ഫറസ് അളവ്
pa: ਫਾਸਫੋਰਸ ਸਮੱਗਰੀ
ta: பாஸ்பரஸ் உள்ளடக்கம்
te: ఫాస్పరస్ కంటెంట్

source: Potassium Content
bn: পটাসিয়াম উপাদান
kn: ಪೊಟ್ಯಾಶಿಯಮ್ ಅಂಶ
ml: പൊട്ടാസ്യം അളവ്
pa: ਪੋਟਾਸ਼ਿਯਮ ਸਮੱਗਰੀ
ta: பொடாஷியம் உள்ளடக்கம்
te: పొటాషియం కంటెంట్

source: Temperature
bn: তাপমাত্রা
kn: ಉಷ್ಣೋಗ್ರತೆ
ml: താപനില
pa: ਤਾਪਮਾਨ
ta: வெப்பநிலை
te: ఉష్ణోగ్రత

source: pH
bn: পিএইচ
kn: ಪಿಎಚ್
ml: പിഎച്ച്
pa: ਪੀਐਚ
ta: பிஎச்
te: పిహెచ్

source: Rainfall
bn: বৃষ্টিপাত
kn: ಮಳೆಹೋರತಮ
ml: മഴ
pa: ਮੀਂਹ
ta: மழையளவு
te: వర్షపాతం

source: Get Recommendation
bn: সুপারিশ পান
kn: ಶಿಫಾರಸು ಪಡೆಯಿರಿ
ml: ശുപാർശ നേടുക
pa: ਸਿਫਾਰਿਸ਼ ਪ੍ਰਾਪਤ ਕਰੋ
ta: பரிந்துரையைப் பெறு
te: సిఫార్సు పొందండి

source: Enter crop name
bn: ফসলের নাম লিখুন
kn: ಬೆಳೆಯ ಹೆಸರು ನಮೂದಿಸಿ
ml: വിള പേര് നൽകുക
pa: ਫਸਲ ਦਾ ਨਾਮ ਦਾਖਲ ਕਰੋ
ta: பயிர் பெயரை உள்ளிடவும்
te: పంట పేరు నమోదు చేయండి

source: Enter soil type
bn: মাটির ধরন লিখুন
kn: ಮಣ್ಣಿನ ರಀತಿ ನಮೂದಿಸಿ
ml: മണ്ണിന്റെ തരം നൽകുക
pa: ਮਿੱਟੀ ਦੀ ਕਿਸਮ ਦਾਖਲ ਕਰੋ
ta: மண் வகையை உள்ளிடவும்
te: మట్టి రకం నమోదు చేయండి

source: Enter nitrogen content
bn: নাইট্রোজেন সামগ্রী লিখুন
kn: ನೈಟ್ರೋಜನ್ ಸಾಮಗ್ರಿಯನ್ನು ನಮೂದಿಸಿ
ml: നൈട്രജൻ അളവ് നൽകുക
pa: ਨਾਈਟ੍ਰੋਜਨ ਸਮੱਗਰੀ ਦਰਜ ਕਰੋ
ta: நைட்ரஜன் உள்ளடக்கத்தை உள்ளீடு செய்யுங்கள்
te: నైట్రోజన్ కంటెంట్ నమోదు చేయండి

source: Enter phosphorous content
bn: ফসফরাস সামগ্রী লিখুন
kn: ಫಾಸ್ಫರಸ್ ಸಾಮಗ್ರಿಯನ್ನು ನಮೂದಿಸಿ
ml: ഫോസ്ഫറസ് അളവ് നൽകുക
pa: ਫਾਸਫੋਰਸ ਸਮੱਗਰੀ ਦਰਜ ਕਰੋ
ta: பாஸ்பரஸ் உள்ளடக்கத்தை உள்ளீடு செய்யுங்கள்
te: ఫాస్ఫరస్ కంటెంట్ నమోదు చేయండి

source: Enter potassium content
bn: পটাশিয়াম সামগ্রী লিখুন
kn: ಪೋಟ್ಯಾಸಿಯಮ್ ಸಾಮಗ್ರಿಯನ್ನು ನಮೂದಿಸಿ
ml: പൊട്ടാസ്യം അളവ് നൽകുക
pa: ਪੋਟਾਸ਼ੀਅਮ ਸਮੱਗਰੀ ਦਰਜ ਕਰੋ
ta: பொட்டாசியம் உள்ளடக்கத்தை உள்ளீடு செய்யுங்கள்
te: పొటాసియం కంటెంట్ నమోదు చేయండి

# enterTemperature
source: Enter temperature (°C)
bn: তাপমাত্রা লিখুন
kn: ತಾಪಮಾನವನ್ನು ನಮೂದಿಸಿ
ml: താപനില നൽകുക (°C)
pa: ਤਾਪਮਾਨ ਦਰਜ ਕਰੋ
ta: வெப்பநிலையை உள்ளீடு செய்யுங்கள்
te: ఉష్ణోగ్రత నమోదు చేయండి

source: Enter humidity (%)
bn: আর্দ্রতা লিখুন
kn: ಆರ್ದ್ರತೆಯನ್ನು ನಮೂದಿಸಿ
ml: ആർദ്രത നൽകുക (%)
pa: ਨਮੀ ਦਰਜ ਕਰੋ
ta: ஈரப்பதத்தை உள்ளீடு செய்யுங்கள்
te: తేమ నమోదు చేయండి

# enterPh
source: Enter pH value
bn: pH মান লিখুন
kn: pH ಮೌಲ್ಯವನ್ನು ನಮೂದಿಸಿ
ml: പിഎച്ച് മൂല്യം നൽകുക
pa: pH ਮੁੱਲ ਦਰਜ ਕਰੋ
ta: pH மதிப்பை உள்ளீடு செய்யுங்கள்
te: pH విలువ నమోదు చేయండి

# enterRainfall
source: Enter rainfall (mm)
bn: বৃষ্টিপাত লিখুন
kn: ಮಳೆಯ ಪ್ರಮಾಣವನ್ನು ನಮೂದಿಸಿ
ml: മഴയുടെ അളവ് നൽകുക (മിമി)
pa: ਬਾਰਿਸ਼ ਦੀ ਮਾਤਰਾ ਦਰਜ ਕਰੋ
ta: மழை அளவை உள்ளீடு செய்யுங்கள்
te: వర్షపాతం నమోదు చేయండి

source: Please fill all fields
bn: অনুগ্রহ করে সমস্ত ক্ষেত্র পূরণ করুন
kn: ದಯವಿಟ್ಟು ಎಲ್ಲಾ ಫೀಲ್ಡ್‌ಗಳನ್ನು ಭರಿಸಿ
ml: ദയവായി എല്ലാ ഫീൽഡുകളും പൂരിപ്പിക്കുക
pa: ਕਿਰਪਾ ਕਰਕੇ ਸਾਰੇ ਖੇਤ ਭਰੋ
ta: தயவு செய்து அனைத்து களங்களையும் பூர்த்தி செய்யவும்
te: దయచేసి అన్ని ఫీల్డ్‌లను పూరించండి

source: Invalid input
bn: অবৈধ ইনপুট
kn: ಅವೈಧ ಇನ್‌ಪುಟ್
ml: അസാധുവായ ഇൻപുട്ട്
pa: ਗਲਤ ਇਨਪੁੱਟ
ta: தவறான உள்ளீடு
te: చెల్లని ఇన్‌పుట్

source: Error getting recommendation
bn: সুপারিশ পেতে ত্রুটি
kn: ಶಿಫಾರಸು ಪಡೆಯುವಲ್ಲಿ ದೋಷ
ml: ശുപാർശ നേടുന്നതിൽ പിശക്
pa: ਸਿਫਾਰਸ਼ ਪ੍ਰਾਪਤ ਕਰਨ ਵਿੱਚ ਗਲਤੀ
ta: பரிந்துரை பெறுவதில் பிழை
te: సిఫార్సు పొందడంలో లోపం

source: Upload or Take Photo
bn: আপলোড বা ছবি তুলুন
kn: ಅಪ್‌ಲೋಡ್ ಅಥವಾ ಫೋಟೋ ತೆಗೆಯಿರಿ
ml: അപ്‌ലോഡ് ചെയ്യുക അല്ലെങ്കിൽ ഫോട്ടോ എടുക്കുക
pa: ਅੱਪਲੋਡ ਕਰੋ ਜਾਂ ਫੋਟੋ ਲਓ
ta: பதிவேற்று அல்லது புகைப்படம் எடு
te: అప్‌లోడ్ చేయు లేదా ఫోటో తీయండి

source: Select Image
bn: ছবি নির্বাচন করুন
kn: ಚಿತ್ರ ಆಯ್ಕೆ ಮಾಡಿ
ml: ചിത്രം തിരഞ്ഞെടുക്കുക
pa: ਤਸਵੀਰ ਚੁਣੋ
ta: படத்தை தேர்ந்தெடுக்கவும்
te: చిత్రాన్ని ఎంచుకోండి

source: Camera
bn: ক্যামেরা
kn: ಕ್ಯಾಮೆರಾ
ml: ക്യാമറ
pa: ਕੈਮਰਾ
ta: கேமரா
te: కెమెరా

source: Gallery
bn: গ্যালারি
kn: ಗ್ಯಾಲರಿ
ml: ഗാലറി
pa: ਗੈਲਰੀ
ta: கேலரி
te: గ్యాలరీ

source: Analyze Image
bn: ছবি বিশ্লেষণ করুন
kn: ಚಿತ್ರ ವಿಶ್ಲೇಷಣೆ ಮಾಡಿ
ml: ചിത്രം വിശകലനം ചെയ്യുക
pa: ਤਸਵੀਰ ਦਾ ਵਿਸ਼ਲੇਸ਼ਣ ਕਰੋ
ta: படத்தை பரிசீலிக்கவும்
te: చిత్రాన్ని విశ్లేషించండి

source: Analyzing...
bn: বিশ্লেষণ করা হচ্ছে...
kn: ವಿಶ್ಲೇಷಿಸುತ್ತಿದ್ದೇನೆ...
ml: വിശകലനം ചെയ്യുന്നു...
pa: ਵਿਸ਼ਲੇਸ਼ਣ ਕਰ ਰਿਹਾ ਹੈ...
ta: பரிசீலிக்கிறது...
te: విశ్లేషిస్తున్నాం...

source: Analysis Complete
bn: বিশ্লেষণ সম্পূর্ণ
kn: ವಿಶ್ಲೇಷಣೆ ಪೂರ್ಣಗೊಂಡಿದೆ
ml: വിശകലനം പൂർത്തിയായി
pa: ਵਿਸ਼ਲੇਸ਼ਣ ਪੂਰਾ ਹੋਇਆ
ta: பரிசீலனை முடிந்தது
te: విశ్లేషణ పూర్తయింది

source: No image selected
bn: কোনো ছবি নির্বাচন করা হয়নি
kn: ಯಾವುದೇ ಚಿತ್ರವನ್ನು ಆಯ್ಕೆ ಮಾಡಲಾಗಿಲ್ಲ
ml: ചിത്രം തിരഞ്ഞെടുത്തിട്ടില്ല
pa: ਕੋਈ ਚਿੱਤਰ ਨਹੀਂ ਚੁਣਿਆ ਗਿਆ
ta: படம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை
te: చిత్రం ఎంచుకోబడలేదు

source: Image analysis failed
bn: ছবি বিশ্লেষণ ব্যর্থ
kn: ಚಿತ್ರ ವಿಶ್ಲೇಷಣೆ ವಿಫಲವಾಗಿದೆ
ml: ചിത്ര വിശകലനം പരാജയപ്പെട്ടു
pa: ਚਿੱਤਰ ਵਿਸ਼ਲੇਸ਼ਣ ਅਸਫਲ
ta: பட பகுப்பு தோல்வியடைந்தது
te: చిత్ర విశ్లేషణ విఫలమైంది

# selectImageFirst
source: Please select an image first
bn: অনুগ্রহ করে প্রথমে একটি ছবি নির্বাচন করুন
kn: ದಯವಿಟ್ಟು ಮೊದಲು ಒಂದು ಚಿತ್ರವನ್ನು ಆಯ್ಕೆ ಮಾಡಿ
ml: ദയവായി ആദ്യം ഒരു ചിത്രം തിരഞ്ഞെടുക്കുക
pa: ਕਿਰਪਾ ਕਰਕੇ ਪਹਿਲਾਂ ਇੱਕ ਚਿੱਤਰ ਚੁਣੋ
ta: முதலில் ஒரு படத்தைத் தேர்ந்தெடுக்கவும்
te: దయచేసి మొదట ఒక చిత్రాన్ని ఎంచుకోండి

source: Area
bn: এলাকা
kn: ಪ್ರದೇಶ
ml: പ്രദേശം
pa: ਖੇਤਰ
ta: பகுதி
te: ప్రాంతం

# enterArea
source: Enter area (hectares)
bn: এলাকা লিখুন (হেক্টর)
kn: ಪ್ರದೇಶವನ್ನು ನಮೂದಿಸಿ (ಹೆಕ್ಟೇರ್)
ml: പ്രദേശം നൽകുക (ഹെക്ടർ)
pa: ਖੇਤਰ ਦਰਜ ਕਰੋ (ਹੈਕਟੇਅਰ)
ta: பகுதியை உள்ளீடு செய்யுங்கள் (ஹெக்டேரில்)
te: ప్రాంతాన్ని నమోదు చేయండి (హెక్టార్లలో)

source: Get Prediction
bn: পূর্বাভাস পান
kn: ಮುನ್ಸೂಚನೆ ಪಡೆಯಿರಿ
ml: പ്രവചനം നേടുക
pa: ਅਨੁਮਾਨ ਪ੍ਰਾਪਤ ਕਰੋ
ta: கணிப்பைப் பெறு
te: అంచనా పొందు

source: Enter area value
bn: এলাকার মান লিখুন
kn: ಪ್ರದೇಶದ ಮೌಲ್ಯವನ್ನು ನಮೂದಿಸಿ
ml: പ്രദേശത്തിന്റെ മൂല്യം നൽകുക
pa: ਖੇਤਰ ਦਾ ਮੁੱਲ ਦਰਜ ਕਰੋ
ta: பகுதி மதிப்பை உள்ளீடு செய்யுங்கள்
te: ప్రాంత విలువ నమోదు చేయండి

source: Predicting...
bn: পূর্বাভাস করা হচ্ছে...
kn: ಮುನ್ಸೂಚಿಸುತ್ತಿದೆ...
ml: പ്രവചിക്കുന്നു...
pa: ਅਨੁਮਾਨ ਲਗਾ ਰਿਹਾ ਹੈ...
ta: கணிக்கிறது...
te: అంచనా వేస్తోంది...

source: Prediction Complete
bn: পূর্বাভাস সম্পন্ন
kn: ಮುನ್ಸೂಚನೆ ಪೂರ್ಣ
ml: പ്രവചനം പൂർത്തിയായി
pa: ਅਨੁਮਾਨ ਪੂਰਾ
ta: கணிப்பு முடிந்தது
te: అంచనా పూర్తైంది

source: Error getting prediction
bn: পূর্বাভাস পেতে ত্রুটি
kn: ಮುನ್ಸೂಚನೆ ಪಡೆಯುವಲ್ಲಿ ದೋಷ
ml: പ്രവചനം നേടുന്നതിൽ പിശക്
pa: ਅਨੁਮਾਨ ਪ੍ਰਾਪਤ ਕਰਨ ਵਿੱਚ ਗਲਤੀ
ta: கணிப்பைப் பெறுவதில் பிழை
te: అంచనా పొందడంలో లోపం

source: Location permission denied
bn: অবস্থান অনুমতি অস্বীকার করা হয়েছে
kn: ಸ್ಥಳ ಅನುಮತಿ ನಿರಾಕರಿಸಲಾಗಿದೆ
ml: ലൊക്കേഷൻ അനുമതി നിഷേധിച്ചു
pa: ਸਥਾਨ ਅਨੁਮਤੀ ਅਸਵੀਕਾਰ ਕੀਤੀ ਗਈ
ta: இட அனுமதி மறுக்கப்பட்டது
te: స్థాన అనుమతి నిరాకరించబడింది

# enableLocationServices
source: Please enable location services
bn: অনুগ্রহ করে অবস্থান পরিষেবা সক্ষম করুন
kn: ದಯವಿಟ್ಟು ಸ್ಥಳ ಸೇವೆಗಳನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಿ
ml: ദയവായി ലൊക്കേഷൻ സേവനങ്ങൾ പ്രവർത്തനക്ഷമമാക്കുക
pa: ਕਿਰਪਾ ਕਰਕੇ ਸਥਾਨ ਸੇਵਾਵਾਂ ਸਮਰੱਥ ਕਰੋ
ta: இட சேவைகளை இயக்கவும்
te: దయచేసి స్థాన సేవలను ప్రారంభించండి

source: Fetching weather data...
bn: আবহাওয়া ডেটা আনা হচ্ছে...
kn: ಹವಾಮಾನ ಡೇಟಾ ಪಡೆಯಲಾಗುತ್ತಿದೆ...
ml: കാലാവസ്ഥ ഡാറ്റ ലഭ്യമാക്കുന്നു...
pa: ਮੌਸਮ ਡੇਟਾ ਪ੍ਰਾਪਤ ਕੀਤਾ ਜਾ ਰਿਹਾ ਹੈ...
ta: வானிலை தரவைப் பெறுகிறது...
te: వాతావరణ డేటాను పొందుతోంది...

# weatherError
source: Error fetching weather data
bn: আবহাওয়া ডেটা আনতে ত্রুটি
kn: ಹವಾಮಾನ ಡೇಟಾ ಪಡೆಯುವಲ್ಲಿ ದೋಷ
ml: കാലാവസ്ഥാ ഡാറ്റ ലഭ്യമാക്കുന്നതിൽ പിശക്
pa: ਮੌਸਮ ਡੇਟਾ ਪ੍ਰਾਪਤ ਕਰਨ ਵਿੱਚ ਗਲਤੀ
ta: வானிலை தரவைப் பெறுவதில் பிழை
te: వాతావరణ డేటా పొందడంలో లోపం

source: Theme
bn: থিম
kn: ಥೀಮ್
ml: തീം
pa: ਥੀਮ
ta: தீம்
te: థీమ్

source: Light Theme
bn: হালকা থিম
kn: ಲೈಟ್ ಥೀಮ್
ml: ലൈറ്റ് തീം
pa: ਲਾਈਟ ਥੀਮ
ta: வெளிச் தீம்
te: లైట్ థీమ్

source: Dark Theme
bn: গাঢ় থিম
kn: ಡಾರ್ಕ್ ಥೀಮ್
ml: ഡാർക്ക് തീം
pa: ਡਾਰਕ ਥੀਮ
ta: இருள் தீம்
te: డార్క్ థీమ్

source: System Theme
bn: সিস্টেম থিম
kn: ಸಿಸ್ಟಮ್ ಥೀಮ್
ml: സിസ്റ്റം തീം
pa: ਸਿਸਟਮ ਥੀਮ
ta: கருவி தீம்
te: సిస్టమ్ థీమ్

source: Notification
bn: বিজ্ঞপ্তি
kn: ಅಧಿಸೂಚನೆ
ml: അറിയിപ്പ്
pa: ਸੂਚਨਾ
ta: அறிவிப்பு
te: నోటిఫికేషన్

source: Enable Notifications
bn: বিজ্ঞপ্তি সক্ষম করুন
kn: ಅಧಿಸೂಚನೆಗಳನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಿ
ml: അറിയിപ്പുകൾ പ്രവർത്തനക്ഷമമാക്കുക
pa: ਸੂਚਨਾਵਾਂ ਨੂੰ ਸਕਿਰਿਆ ਕਰੋ
ta: அறிவிப்புகளை செயல்படுத்தவும்
te: నోటిఫికేషన్‌లను ప్రారంభించండి

source: Push Notifications
bn: পুশ বিজ্ঞপ্তি
kn: ಪುಶ್ ಅಧಿಸೂಚನೆಗಳು
ml: പുഷ് അറിയിപ്പുകൾ
pa: ਪੁਸ਼ ਨੋਟੀਫਿਕੇਸ਼ਨ
ta: புஷ் அறிவிப்புகள்
te: పుష్ నోటిఫికేషన్లు

source: Email Notifications
bn: ইমেইল বিজ্ঞপ্তি
kn: ಇಮೇಲ್ ಅಧಿಸೂಚನೆಗಳು
ml: ഇമെയിൽ അറിയിപ്പുകൾ
pa: ਈਮੇਲ ਨੋਟੀਫਿਕੇਸ਼ਨ
ta: மின்னஞ்சல் அறிவிப்புகள்
te: ఇమెయిల్ నోటిఫికేషన్లు

source: SMS Notifications
bn: SMS বিজ্ঞপ্তি
kn: SMS ಅಧಿಸೂಚನೆಗಳು
ml: എസ്എംഎസ് അറിയിപ്പുകൾ
pa: SMS ਨੋਟੀਫਿਕੇਸ਼ਨ
ta: SMS அறிவிப்புகள்
te: SMS నోటిఫికేషన్లు

source: Privacy Policy
bn: গোপনীয়তা নীতি
kn: ಗೌಪ್ಯತಾ ನೀತಿ
ml: സ്വകാര്യതാ നയം
pa: ਨਿੱਜਤਾ ਨੀਤੀ
ta: தனியுரிமை கೊளகை
te: గోప్యతా విధానం

source: Terms of Service
bn: সেবার শর্তাবলী
kn: ಸೇವಾ ನಿಯಮಗಳು
ml: സേവന നിബന്ധനകൾ
pa: ਸੇਵਾ ਦੀਆਂ ਸ਼ਰਤਾਂ
ta: சேவை விதிமுறைகள்
te: సేవా నిబంధనలు

source: About App
bn: অ্যাপ সম্পর্কে
kn: ಅಪ್ಲಿಕೇಶನ್ ಕುರಿತು
ml: ആപ്പിനെക്കുറിച്ച്
pa: ਐਪ ਬਾਰੇ
ta: பயன்பாடு பற்றி
te: అప్ గురించి

source: Version
bn: সংস্করণ
kn: ಸಂಸ್ಕರಣೆ
ml: പതിപ്പ്
pa: ਵਰਜਨ
ta: வெர்ஷன்
te: వెర్షన్

source: App Version
bn: অ্যাপ সংস্করণ
kn: ಅಪ್ಲಿಕೇಶನ್ ಆವೃತ್ತಿ
ml: ആപ്പ് പതിപ്പ്
pa: ਐਪ ਵਰਜਨ
ta: பயன்பாடு பதிப்பு
te: అప్ వెర్షన్

source: Build Number
bn: বিল্ড নম্বর
kn: ಬಿಲ್ಡ್ ಸಂಖ್ಯೆ
ml: ബിൽഡ് നമ്പർ
pa: ਬਿਲਡ ਨੰਬਰ
ta: கட்ட எண்
te: బిల్డ్ నంబర్

source: Developer
bn: ডেভেলপার
kn: ಡೆವಲಪರ್
ml: ഡെവലപ്പർ
pa: ਡਿਵੈਲਪਰ
ta: டெவலப்பர்
te: డెవలపర్

source: Contact
bn: যোগাযোগ
kn: ಸಂಪರ್ಕ
ml: ബന്ധപ്പെടുക
pa: ਸੰਪਰਕ
ta: தொடர்பு
te: సంప్రదించు

source: Support
bn: সহায়তা
kn: ಬೆಂಬಲ
ml: പിന്തുണ
pa: ਸਹਾਇਤਾ
ta: ஆதரவு
te: మద్దతు

source: Rate App
bn: অ্যাপ রেট করুন
kn: ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ರೇಟ್ ಮಾಡಿ
ml: ആപ്പിനെ റേറ്റ് ചെയ്യുക
pa: ਐਪ ਨੂੰ ਰੇਟ ਕਰੋ
ta: பயன்பாட்டை மதிப்பிடு
te: అప్‌ను రేట్ చేయు

source: Share App
bn: অ্যাপ শেয়ার করুন
kn: ಅಪ್ಲಿಕೇಶನ್ ಹಂಚಿಕೊಳ್ಳಿ
ml: ആപ്പ് പങ്കിടുക
pa: ਐਪ ਸ਼ੇਅਰ ਕਰੋ
ta: பயன்பாட்டைப் பகிர்
te: అప్‌ను షేర్ చేయు

source: Feedback
bn: প্রতিক্রিয়া
kn: ಪ್ರತಿಕ್ರಿಯೆ
ml: ഫീഡ്ബാക്ക്
pa: ਫੀਡਬੈਕ
ta: கருத்து
te: అభిప్రాయం

source: Report Bug
bn: বাগ রিপোর্ট করুন
kn: ಬಗ್ ವರದಿ ಮಾಡಿ
ml: ബഗ് റിപ്പോർട്ട് ചെയ്യുക
pa: ਬੱਗ ਰਿਪੋਰਟ ਕਰੋ
ta: பிழையைப் புகாரளி
te: బగ్ నివేదించు

source: Help
bn: সাহায্য
kn: ಸಹಾಯ
ml: സഹായം
pa: ਮਦਦ
ta: உதவி
te: సహాయం

source: FAQ
ml: പതിവ് ചോദ്യങ്ങൾ

source: Tutorial
bn: টিউটোরিয়াল
kn: ಟ್ಯುಟೋರಿಯಲ್
ml: ട്യൂട്ടോറിയൽ
pa: ਟਿਊਟੋਰਿਅਲ
ta: பயிற்சி
te: ట్యుటోరియల్

source: Guide
bn: গাইড
kn: ಮಾರ್ಗದರ್ಶಿ
ml: ഗൈഡ്
pa: ਗਾਈਡ
ta: வழிகாட்டி
te: గైడ్

source: Tips
bn: টিপস
kn: ಸಲಹೆಗಳು
ml: നുറുങ്ങുകൾ
pa: ਸਲਾਹ
ta: உதவிக்குறிப்புகள்
te: సలహాలు

source: News
bn: খবর
kn: ಸುದ್ದಿ
ml: വാർത്തകൾ
pa: ਖ਼ਬਰਾਂ
ta: செய்திகள்
te: వార్తలు

source: Updates
bn: আপডেট
kn: ನವೀಕರಣಗಳು
ml: അപ്ഡേറ്റുകൾ
pa: ਅੱਪਡੇਟ
ta: புதுப்பிப்புகள்
te: అప్‌డేట్‌లు

source: What's New
bn: নতুন কী
kn: ಹೊಸದೇನು
ml: പുതിയത് എന്താണ്
pa: ਨਵਾਂ ਕੀ ਹੈ
ta: புதியது என்ன
te: కొత్తది ఏమిటి

source: Changelog
bn: চেঞ্জলগ
kn: ಚೇಂಜ್‌ಲಾಗ್
ml: മാറ്റങ്ങളുടെ പട്ടിക
pa: ਚੇਂਜਲਾਗ
ta: மாற்றப் பதிவு
te: చేంజ్‌లాగ్

source: Loading weather...
bn: আবহাওয়া লোড হচ্ছে...
kn: ಹವಾಮಾನ ಲೋಡ್ ಆಗುತ್ತಿದೆ...
ml: കാലാവസ്ഥ ലോഡ് ചെയ്യുന്നു...
pa: ਮੌਸਮ ਲੋਡ ਹੋ ਰਿਹਾ ਹੈ...
ta: வானிலை ஏற்றப்படுகிறது...
te: వాతావరణం లోడ్ అవుతోంది...

source: Logged in
bn: লগ ইন
kn: ಲಾಗಿನ್ ಆಗಿದೆ
ml: ലോഗിൻ ചെയ്തു
pa: ਲਾਗ ਇਨ
ta: உள்நுழைந்துள்ளது
te: లాగిన్ అయ్యారు

# loggedInAs
source: Logged in as {phone}
bn: {phone} হিসেবে লগ ইন
kn: {phone} ರಲ್ಲಿ ಲಾಗಿನ್ ಆಗಿದೆ
ml: {phone} ആയി ലോഗിൻ ചെയ്തു
pa: {phone} ਵਜੋਂ ਲਾਗ ਇਨ
ta: {phone} ஆக உள்நுழைந்துள்ளது
te: {phone} గా లాగిన్ అయ్యారు

source: Profile Information
bn: প্রোফাইল তথ্য
kn: ಪ್ರೊಫೈಲ್ ಮಾಹಿತಿ
ml: പ്രൊഫൈൽ വിവരങ്ങൾ
pa: ਪ੍ਰੋਫਾਈਲ ਜਾਣਕਾਰੀ
ta: சுயவிவரத் தகவல்
te: ప్రొఫైల్ సమాచారం

source: Farm Information
bn: খামার তথ্য
kn: ಕೃಷಿ ಮಾಹಿತಿ
ml: കൃഷി വിവരങ്ങൾ
pa: ਖੇਤੀ ਦੀ ਜਾਣਕਾਰੀ
ta: விவசாயத் தகவல்
te: వ్యవసాయ సమాచారం

source: Full Name
bn: পুরো নাম
kn: ಪೂರ್ಣ ಹೆಸರು
ml: പൂർണ്ണ നാമം
pa: ਪੂਰਾ ਨਾਮ
ta: முழு பெயர்
te: పూర్తి పేరు

source: Locality
bn: অবস্থান
kn: ಪ್ರದೇಶ
ml: പ്രദേശം
pa: ਥਾਂ
ta: இடம்
te: ప్రాంతం

source: Enter your name
bn: আপনার নাম লিখুন
kn: ನಿಮ್ಮ ಹೆಸರನ್ನು ನಮೂದಿಸಿ
ml: നിങ്ങളുടെ പേര് നൽകുക
pa: ਆਪਣਾ ਨਾਮ ਦਾਖਲ ਕਰੋ
ta: உங்கள் பெயரை உள்ளிடவும்
te: మీ పేరు నమోదు చేయండి

source: Enter your locality
bn: আপনার অবস্থান লিখুন
kn: ನಿಮ್ಮ ಪ್ರದೇಶವನ್ನು ನಮೂದಿಸಿ
ml: നിങ്ങളുടെ പ്രദേശം നൽകുക
pa: ਆਪਣੀ ਥਾਂ ਦਾਖਲ ਕਰੋ
ta: உங்கள் இடத்தை உள்ளிடவும்
te: మీ ప్రాంతాన్ని నమోదు చేయండి

source: Enter your email
bn: আপনার ইমেল লিখুন
kn: ನಿಮ್ಮ ಇಮೇಲ್ ನಮೂದಿಸಿ
ml: നിങ്ങളുടെ ഇമെയിൽ നൽകുക
pa: ਆਪਣਾ ਈਮੇਲ ਦਾਖਲ ਕਰੋ
ta: உங்கள் மின்னஞ்சலை உள்ளிடவும்
te: మీ ఇమెయిల్ నమోదు చేయండి

source: Enter your phone
bn: আপনার ফোন লিখুন
kn: ನಿಮ್ಮ ಫೋನ್ ನಮೂದಿಸಿ
ml: നിങ്ങളുടെ ഫോൺ നമ്പർ നൽകുക
pa: ਆਪਣਾ ਫੋਨ ਦਾਖਲ ਕਰੋ
ta: உங்கள் தொலைபேசியை உள்ளிடவும்
te: మీ ఫోన్ నమోదు చేయండి

source: Land Area
bn: জমির পরিমাণ
kn: ಭೂಮಿ ವಿಸ್ತೀರ್ಣ
ml: ഭൂമി വിസ്തീർണ്ണം
pa: ਜ਼ਮੀਨ ਦਾ ਖੇਤਰ
ta: நிலப் பரப்பு
te: భూమి విస్తీర్ణం

source: Enter land area
bn: জমির পরিমাণ লিখুন
kn: ಭೂಮಿ ವಿಸ್ತೀರ್ಣ ನಮೂದಿಸಿ
ml: ഭൂമി വിസ്തീർണ്ണം നൽകുക
pa: ਜ਼ਮੀਨ ਦਾ ਖੇਤਰ ਦਾਖਲ ਕਰੋ
ta: நிலப் பரப்பை உள்ளிடவும்
te: భూమి విస్తీర్ణం నమోదు చేయండి

source: Types of Crops
bn: ফসলের ধরন
kn: ಬೆಳೆಗಳ ಪ್ರಕಾರಗಳು
ml: കൃഷി വിഭാഗങ്ങൾ
pa: ਫਸਲਾਂ ਦੀਆਂ ਕਿਸਮਾਂ
ta: பயிர் வகைகள்
te: పంటల రకాలు

source: Enter types of crops
bn: ফসলের ধরন লিখুন
kn: ಬೆಳೆಗಳ ಪ್ರಕಾರಗಳನ್ನು ನಮೂದಿಸಿ
ml: കൃഷി വിഭാഗങ്ങൾ നൽകുക
pa: ਫਸਲਾਂ ਦੀਆਂ ਕਿਸਮਾਂ ਦਾਖਲ ਕਰੋ
ta: பயிர் வகைகளை உள்ளிடவும்
te: పంటల రకాలు నమోదు చేయండి

source: Fertilizers and Chemicals
bn: সার এবং রাসায়নিক
kn: ರಸಗೊಬ್ಬರಗಳು ಮತ್ತು ರಾಸಾಯನಿಕಗಳು
ml: എരുവകൾ/രാസവസ്തുക്കൾ
pa: ਖਾਦਾਂ ਅਤੇ ਰਸਾਇਣ
ta: உரங்கள் மற்றும் இரசாயனங்கள்
te: ఎరువులు మరియు రసాయనాలు

# enterFertilizersAndChemicals
source: Enter fertilizers/chemicals
bn: সার/রাসায়নিক লিখুন
kn: ರಸಗೊಬ್ಬರಗಳು/ರಾಸಾಯನಿಕಗಳನ್ನು ನಮೂದಿಸಿ
ml: എരുവകൾ/രാസവസ്തുക്കൾ നൽകുക
pa: ਖਾਦਾਂ/ਰਸਾਇਣ ਦਾਖਲ ਕਰੋ
ta: உரங்கள்/இரசாயனங்களை உள்ளிடவும்
te: ఎరువులు/రసాయనాలు నమోదు చేయండి

source: Source of Irrigation
bn: সেচের উৎস
kn: ನೀರಾವರಿ ಮೂಲ
ml: ജലസേചന മൂലം
pa: ਸਿੰਚਾਈ ਦਾ ਸਰੋਤ
ta: நீர்ப்பாசன மூலம்
te: నీటిపారుదల మూలం

source: Enter source of irrigation
bn: সেচের উৎস লিখুন
kn: ನೀರಾವರಿ ಮೂಲವನ್ನು ನಮೂದಿಸಿ
ml: ജലസേചന മൂലം നൽകുക
pa: ਸਿੰਚਾਈ ਦਾ ਸਰੋਤ ਦਾਖਲ ਕਰੋ
ta: நீர்ப்பாசன மூலத்தை உள்ளிடவும்
te: నీటిపారుదల మూలం నమోదు చేయండి

source: Number of Crops
bn: ফসলের সংখ্যা
kn: ಬೆಳೆಗಳ ಸಂಖ್ಯೆ
ml: കൃഷി എണ്ണം
pa: ਫਸਲਾਂ ਦੀ ਗਿਣਤੀ
ta: பயிர்களின் எண்ணிக்கை
te: పంటల సంఖ్య

source: Enter number of crops
bn: ফসলের সংখ্যা লিখুন
kn: ಬೆಳೆಗಳ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ
ml: കൃഷി എണ്ണം നൽകുക
pa: ਫਸਲਾਂ ਦੀ ਗਿਣਤੀ ਦਾਖਲ ਕਰੋ
ta: பயிர்களின் எண்ணிக்கையை உள்ளீடு செய்யவும்
te: పంటల సంఖ్య నమోదు చేయండి

source: Preferences
bn: পছন্দসমূহ
kn: ಆದ್ಯತೆಗಳು
ml: മുൻഗണനകൾ
pa: ਤਰਜੀਹਾਂ
ta: விருப்பங்கள்
te: ప్రాధాన్యతలు

source: Save Changes
bn: পরিবর্তনগুলি সংরক্ষণ করুন
kn: ಬದಲಾವಣೆಗಳನ್ನು ಉಳಿಸಿ
ml: മാറ്റങ്ങൾ സംരക്ഷിക്കുക
pa: ਤਬਦੀਲੀਆਂ ਸੁਰੱਖਿਅਤ ਕਰੋ
ta: மாற்றங்களைச் சேமிக்கவும்
te: మార్పులను సేవ్ చేయండి

source: Profile updated successfully!
bn: প্রোফাইল সফলভাবে আপডেট হয়েছে!
kn: ಪ್ರೊಫೈಲ್ ಯಶಸ್ವಿಯಾಗಿ ನವೀಕರಿಸಲಾಗಿದೆ!
ml: പ്രൊഫൈൽ വിജയകരമായി അപ്ഡേറ്റ് ചെയ്തു!
pa: ਪ੍ਰੋਫਾਈਲ ਸਫਲਤਾਪੂਰਵਕ ਅਪਡੇਟ ਹੋਈ!
ta: சுயவிவரம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது!
te: ప్రొఫైల్ విజయవంతంగా అప్‌డేట్ చేయబడింది!

source: Are you sure you want to logout?
bn: আপনি কি লগ আউট করতে চান?
kn: ನೀವು ಲಾಗ್ ಔಟ್ ಮಾಡಲು ಬಯಸುತ್ತೀರಾ?
ml: നിങ്ങൾക്ക് ലോഗൗട്ട് ചെയ്യണമെന്ന് ഉറപ്പാണോ?
pa: ਕੀ ਤੁਸੀਂ ਲੌਗ ਆਉਟ ਕਰਨਾ ਚਾਹੁੰਦੇ ਹੋ?
ta: நீங்கள் வெளியேற விரும்புகிறீர்களா?
te: మీరు లాగ్ అవుట్ చేయాలనుకుంటున్నారా?

source: Are you sure you want to clear all conversation history?
bn: আপনি কি সত্যিই সমস্ত কথোপকথনের ইতিহাস সাফ করতে চান?
kn: ನೀವು ನಿಜವಾಗಿಯೂ ಎಲ್ಲಾ ಸಂಭಾಷಣೆ ಇತಿಹಾಸವನ್ನು ತೆರವುಗೊಳಿಸಲು ಬಯಸುತ್ತೀರಾ?
ml: എല്ലാ സംഭാഷണ ഹിസ്റ്ററിയും മായ്ക്കണമെന്ന് തീർച്ചയാണോ?
pa: ਕੀ ਤੁਸੀਂ ਸਭ ਗੱਲਬਾਤ ਦੇ ਇਤਿਹਾਸ ਨੂੰ ਸਾਫ਼ ਕਰਨਾ ਚਾਹੁੰਦੇ ਹੋ?
ta: நீங்கள் உண்மையில் அனைத்து உரையாடல் வரலாற்றையும் அழிக்க விரும்புகிறீர்களா?
te: మీరు వాస్తవంగా అన్ని సంభాషణ చరిత్రను తొలగించాలనుకుంటున్నారా?

source: Type your message...
bn: আপনার বার্তা টাইপ করুন...
kn: ನಿಮ್ಮ ಸಂದೇಶವನ್ನು ಟೈಪ್ ಮಾಡಿ...
ml: നിങ്ങളുടെ സന്ദേശം ടൈപ്പ് ചെയ്യുക...
pa: ਆਪਣਾ ਸੁਨੇਹਾ ਟਾਈਪ ਕਰੋ...
ta: உங்கள் செய்தியைத் தட்டச்சு செய்யவும்...
te: మీ సందేశాన్ని టైప్ చేయండి...

source: Talk
bn: কথা বলুন
kn: ಮಾತನಾಡಿ
ml: സംസാരിക്കുക
pa: ਗੱਲ ਕਰੋ
ta: பேசு
te: మాట్లాడండి

source: Soil Parameters
bn: মাটি পরামিতি
kn: ಮಣ್ಣಿನ ಪ್ಯಾರಾಮೀಟರ್‌ಗಳು
ml: മണ്ണ് പരാമീറ്ററുകൾ
pa: ਮਿੱਟੀ ਪੈਰਾਮੀਟਰ
ta: மண் அளவுருக்கள்
te: మట్టి పారామితులు

source: Environmental Parameters
bn: পরিবেশগত পরামিতি
kn: ಪರಿಸರದ ನಿಯತಾಂಕಗಳು
ml: പരിസ്ഥിതി പരാമീറ്ററുകൾ
pa: ਵਾਤਾਵਰਣ ਪੈਰਾਮੀਟਰ
ta: சுற்றுச்சூழல் அளவுருக்கள்
te: పర్యావరణ పారామితులు

source: Nitrogen
bn: নাইট্রোজেন
kn: ನೈಟ್ರೋಜನ್
ml: നൈട്രജൻ
pa: ਨਾਈਟ੍ਰੋਜਨ
ta: நைட்ரஜன்
te: నైట్రోజన్

source: Phosphorus
bn: ফসফরাস
kn: ಫಾಸ್ಫರಸ್
ml: ഫോസ്ഫറസ്
pa: ਫਾਸਫੋਰਸ
ta: பாஸ்பரஸ்
te: ఫాస్ఫరస్

source: Potassium
bn: পটাশিয়াম
kn: ಪೊಟ್ಯಾಸಿಯಂ
ml: പൊട്ടാസ്യം
pa: ਪੋਟੈਸ਼ੀਅਮ
ta: பொட்டாசியம்
te: పొటాసియం

source: Required
bn: প্রয়োজনীয়
kn: ಅಗತ್ಯ
ml: ആവശ്യമാണ്
pa: ਲੋੜੀਂਦਾ
ta: தேவை
te: అవసరం

source: Invalid number
bn: অবৈধ সংখ্যা
kn: ಅಮಾನ್ಯ ಸಂಖ್ಯೆ
ml: അസാധുവായ നമ്പർ
pa: ਗਲਤ ਨੰਬਰ
ta: தவறான எண்
te: చెల్లని సంఖ్య

source: Weather Data Error
bn: আবহাওয়া ডেটা ত্রুটি
kn: ಹವಾಮಾನ ಡೇಟಾ ದೋಷ
ml: കാലാവസ്ഥ ഡാറ്റ പിശക്
pa: ਮੌਸਮ ਡੇਟਾ ਗਲਤੀ
ta: வானிலை தரவு பிழை
te: వాతావరణ డేటా లోపం

source: Weather data not available
bn: আবহাওয়া ডেটা উপলব্ধ নয়
kn: ಹವಾಮಾನ ಡೇಟಾ ಲಭ್ಯವಿಲ್ಲ
ml: കാലാവസ്ഥ ഡാറ്റ ലഭ്യമല്ല
pa: ਮੌਸਮ ਡੇਟਾ ਉਪਲਬਧ ਨਹੀਂ ਹੈ
ta: வானிலை தரவு கிடைக்கவில்லை
te: వాతావరణ డేటా అందుబాటులో లేదు

source: Recommended Crop
bn: সুপারিশকৃত ফসল
kn: ಸಲಹೆ ಮಾಡಿದ ಬೆಳೆ
ml: ശുപാർശ ചെയ്ത ഫസൽ
pa: ਸਿਫਾਰਸ਼ ਕੀਤੀ ਫਸਲ
ta: பரிந்துரைக்கப்பட்ட பயிர்
te: సిఫార్సు చేయబడిన పంట

# aiAnalysisAndJustification
source: AI Analysis & Justification
bn: AI বিশ্লেষণ এবং যৌক্তিকতা
kn: AI ವಿಶ್ಲೇಷಣೆ ಮತ್ತು ನ್ಯಾಯೋಕ್ತಿ
ml: AI വിശകലനവും ന്യായവാദവും
pa: AI ਵਿਸ਼ਲੇਸ਼ਣ ਅਤੇ ਵਜ੍ਹਾ
ta: AI பகுப்பாய்வு மற்றும் நியாயம்
te: AI విశ్లేషణ మరియు నిరూపణ

# usingLocalRecommendation
source: Using local recommendation (Service temporarily unavailable)
bn: স্থানীয় সুপারিশ ব্যবহার করা হচ্ছে (পরিষেবা সাময়িকভাবে উপলব্ধ নয়)
kn: ಸ್ಥಳೀಯ ಶಿಫಾರಸು ಬಳಸಲಾಗುತ್ತಿದೆ (ಸೇವೆಯು ತಾತ್ಕಾಲಿಕವಾಗಿ ಲಭ್ಯವಿಲ್ಲ)
ml: ലോക്കൽ ശുപാർശ ഉപയോഗിക്കുന്നു (സേവനം താൽക്കാലികമായി ലഭ്യമല്ല)
pa: ਸਥਾਨਕ ਸਿਫਾਰਿਸ਼ ਦੀ ਵਰਤੋਂ ਕੀਤੀ ਜਾ ਰਹੀ ਹੈ (ਸੇਵਾ ਅਸਥਾਈ ਤੌਰ ਤੇ ਉਪਲਬਧ ਨਹੀਂ ਹੈ)
ta: உள்ளூர்ப் பரிந்துரையைப் பயன்படுத்துகிறது (சேவை தற்காலிகமாக கிடைக்கவில்லை)
te: స్థానిక సిఫార్సు ఉపయోగిస్తోంది (సేవ తాత్కాలికంగా అందుబాటులో లేదు)

source: Soil Suitability
bn: মাটির উপযুক্ততা
kn: ಮಣ್ಣಿನ ಅನುಕೂಲತೆ
ml: മണ്ണിന്റെ അനുയോജ്യത
pa: ਮਿੱਟੀ ਦੀ ਅਨੁਕੂਲਤਾ
ta: மண்ணின் பொருத்தம்
te: మట్టి అనుకూలత

# weatherDataRequired
source: Weather data is required for crop recommendation. Please ensure location permission is granted.
bn: ফসল সুপারিশের জন্য আবহাওয়া ডেটা প্রয়োজন। অনুগ্রহ করে নিশ্চিত করুন যে অবস্থান অনুমতি দেওয়া হয়েছে।
kn: ಬೆಳೆ ಸಲಹೆಗೆ ಹವಾಮಾನ ಡೇಟಾ ಅಗತ್ಯವಿದೆ. ದಯವಿಟ್ಟು ಸ್ಥಳ ಅನುಮತಿಯನ್ನು ನೀಡಲಾಗಿದೆಯೆಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.
ml: ഫസൽ ശുപാർശയ്ക്ക് കാലാവസ്ഥ ഡാറ്റ ആവശ്യമാണ്. ദയവായി ലൊക്കേഷൻ അനുമതി നൽകിയിട്ടുണ്ടെന്ന് ഉറപ്പാക്കുക.
pa: ਫਸਲ ਸਿਫਾਰਸ਼ ਲਈ ਮੌਸਮ ਡੇਟਾ ਦੀ ਲੋੜ ਹੈ। ਕਿਰਪਾ ਕਰਕੇ ਯਕੀਨੀ ਬਣਾਓ ਕਿ ਟਿਕਾਣਾ ਇਜਾਜ਼ਤ ਦਿੱਤੀ ਗਈ ਹੈ।
ta: பயிர் பரிந்துரைக்கு வானிலை தரவு தேவை. இட அனுமதி வழங்கப்பட்டிருப்பதை உறுதிப்படுத்தவும்.
te: పంట సిఫార్సు కోసం వాతావరణ డేటా అవసరం. దయచేసి స్థాన అనుమతి మంజూరు చేయబడిందని నిర్ధారించండి.

# usingCurrentWeatherData
source: Using current weather data as monthly forecast is not available.
bn: মাসিক পূর্বাভাস উপলব্ধ না থাকায় বর্তমান আবহাওয়া ডেটা ব্যবহার করা হচ্ছে।
kn: ಮಾಸಿಕ ಮುನ್ಸೂಚನೆ ಲಭ್ಯವಿಲ್ಲದ ಕಾರಣ ಪ್ರಸ್ತುತ ಹವಾಮಾನ ಡೇಟಾವನ್ನು ಬಳಸುತ್ತಿದೆ.
ml: മാസിക മുന്നറിയിപ്പ് ലഭ്യമല്ലാത്തതിനാൽ നിലവിലെ കാലാവസ്ഥ ഡാറ്റ ഉപയോഗിക്കുന്നു.
pa: ਮਹੀਨਾਵਾਰੀ ਭਵਿੱਖਬਾਣੀ ਉਪਲਬਧ ਨਾ ਹੋਣ ਕਾਰਨ ਮੌਜੂਦਾ ਮੌਸਮ ਡੇਟਾ ਦੀ ਵਰਤੋਂ ਕੀਤੀ ਜਾ ਰਹੀ ਹੈ।
ta: மாதாந்திர முன்னறிவிப்பு கிடைக்காததால் தற்போதைய வானிலை தரவைப் பயன்படுத்துகிறது.
te: నెలవారీ అంచనా అందుబాటులో లేనందున ప్రస్తుత వాతావరణ డేటాను ఉపయోగిస్తోంది.

source: AI Tools
bn: AI সরঞ্জাম
kn: AI ಸಾಧನಗಳು
ml: AI ഉപകരണങ്ങൾ
pa: AI ਸਾਧਨ
ta: AI கருவிகள்
te: AI సాధనాలు

# aiToolsSubtitle
source: Choose an AI-powered tool to help with your farming needs:
bn: আপনার কৃষি চাহিদা পূরণ করতে সাহায্য করার জন্য একটি AI-চালিত সরঞ্জাম চয়ন করুন:
kn: ನಿಮ್ಮ ಕೃಷಿ ಅಗತ್ಯಗಳಿಗೆ ಸಹಾಯ ಮಾಡಲು AI-ಚಾಲಿತ ಸಾಧನವನ್ನು ಆಯ್ಕೆ ಮಾಡಿ:
ml: നിങ്ങളുടെ കൃഷി ആവശ്യങ്ങൾക്ക് സഹായിക്കുന്ന AI-യിൽ പ്രവർത്തിക്കുന്ന ഉപകരണം തിരഞ്ഞെടുക്കുക:
pa: ਆਪਣੀਆਂ ਕਿਸਾਨੀ ਲੋੜਾਂ ਨੂੰ ਪੂਰਾ ਕਰਨ ਵਿੱਚ ਮਦਦ ਕਰਨ ਲਈ ਇੱਕ AI-ਚਲਿਤ ਸਾਧਨ ਚੁਣੋ:
ta: உங்கள் விவசாயத் தேவைகளுக்கு உதவுவதற்கு AI-இயக்கப்படும் கருவியைத் தேர்ந்தெடுக்கவும்:
te: మీ వ్యవసాయ అవసరాలకు సహాయపడే AI-చేత నడిపించే సాధనాన్ని ఎంచుకోండి:

# cropRecommendationDesc
source: Get AI recommendations for the best crops based on soil and weather conditions.
bn: মাটি এবং আবহাওয়ার অবস্থার উপর ভিত্তি করে সেরা ফসলের জন্য AI সুপারিশ পান।
kn: ಮಣ್ಣು ಮತ್ತು ಹವಾಮಾನ ಪರಿಸ್ಥಿತಿಗಳ ಆಧಾರದ ಮೇಲೆ ಉತ್ತಮ ಬೆಳೆಗಳಿಗೆ AI ಶಿಫಾರಸುಗಳನ್ನು ಪಡೆಯಿರಿ.
ml: മണ്ണും കാലാവസ്ഥയും അടിസ്ഥാനമാക്കി മികച്ച ഫസലുകൾക്കുള്ള AI ശുപാർശകൾ നേടുക.
pa: ਮਿੱਟੀ ਅਤੇ ਮੌਸਮ ਦੀ ਹਾਲਤ ਦੇ ਆਧਾਰ ਤੇ ਵਧੀਆਂ ਫਸਲਾਂ ਲਈ AI ਸਿਫਾਰਸ਼ਾਂ ਪ੍ਰਾਪਤ ਕਰੋ।
ta: மண் மற்றும் வானிலை நிலவரங்களின் அடிப்படையில் சிறந்த பயிர்களுக்கு AI பரிந்துரைகளைப் பெறுங்கள்.
te: మట్టి మరియు వాతావరణ పరిస్థితుల ఆధారంగా ఉత్తమ పంటల కోసం AI సిఫార్సులను పొందండి.

# yieldPredictionDesc
source: Predict crop yield based on historical data and current conditions.
bn: উন্নত AI অ্যালগরিদম এবং ঐতিহাসিক ডেটা ব্যবহার করে ফসলের ফলনের পূর্বাভাস দিন।
kn: ಮುಂದುವರಿದ AI ಅಲ್ಗಾರಿದಮ್‌ಗಳು ಮತ್ತು ಚರಿತ್ರಿಕ ಡೇಟಾವನ್ನು ಬಳಸಿಕೊಂಡು ಬೆಳೆ ಇಳುವರಿಯನ್ನು ಮುನ್ಸೂಚಿಸಿ.
ml: വിപുലമായ AI അൽഗോരിദങ്ങളും ചരിത്ര ഡാറ്റയും ഉപയോഗിച്ച് ഫസൽ ഉത്പാദനം മുൻകൂട്ടി കാണുക.
pa: ਤਕਨੀਕੀ AI ਐਲਗੋਰਿਦਮ ਅਤੇ ਇਤਿਹਾਸਕ ਡੇਟਾ ਦੀ ਵਰਤੋਂ ਕਰਕੇ ਫਸਲ ਦੀ ਪੈਦਾਵਾਰ ਦੀ ਭਵਿੱਖਬਾਣੀ ਕਰੋ।
ta: மேம்பட்ட AI அல்காரிதம்கள் மற்றும் வரலாறு தரவைப் பயன்படுத்தி பயிர் விளைச்சலை முன்னறிவு செய்யுங்கள்.
te: అధునాతన AI అల్గారిథమ్‌లు మరియు చారిత్రక డేటాను ఉపయోగించి పంట దిగుబడిని అంచనా వేయండి.

# diseaseDetectionDesc
source: Upload leaf images to detect plant diseases using AI vision.
bn: ছবি বিশ্লেষণ এবং AI প্রযুক্তি ব্যবহার করে ফসলের রোগগুলি তাড়াতাড়ি শনাক্ত করুন।
kn: ಚಿತ್ರ ವಿಶ್ಲೇಷಣೆ ಮತ್ತು AI ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿಕೊಂಡು ಬೆಳೆ ರೋಗಗಳನ್ನು ಮುಂಬರುವಾಗ ಗುರುತಿಸಿ.
ml: ചിത്ര വിശകലനവും AI സാങ്കേതികവിദ്യയും ഉപയോഗിച്ച് ഫസൽ രോഗങ്ങൾ ആദ്യകാലത്ത് തിരിച്ചറിയുക.
pa: ਤਸਵੀਰ ਦੇ ਵਿਸ਼ਲੇਸ਼ਣ ਅਤੇ AI ਤਕਨਾਲੋਜੀ ਦੀ ਵਰਤੋਂ ਕਰਕੇ ਫਸਲ ਦੇ ਰੋਗਾਂ ਦੀ ਜਲਦੀ ਪਛਾਣ ਕਰੋ।
ta: பட பகுப்பாய்வு மற்றும் AI தொழில்நுட்பத்தைப் பயன்படுத்தி பயிர் நோய்களை ஆரம்பத்தில் அடையாளம் காணுங்கள்.
te: చిత్ర విశ్లేషణ మరియు AI సాంకేతికతను ఉపయోగించి పంట వ్యాధులను ముందుగానే గుర్తించండి.

source: Pest Detection
bn: কীটপতঙ্গ সনাক্তকরণ
kn: ಕೀಟ ಕಂಡುಹಿಡಿಯುವಿಕೆ
ml: കീട കണ്ടെത്തൽ
pa: ਕੀੜੇ-ਮਕੌੜੇ ਦੀ ਪਛਾਣ
ta: பூச்சி கண்டுபிடித்தல்
te: కీటకాల గుర్తింపు
